{
  "id": "basic-law-the-judiciary-1984",
  "type": "statute",
  "title": "חוק יסוד: השפיטה",
  "title_en": "Basic Law: The Judiciary, 5744-1984",
  "short_name": "BL-JUD",
  "status": "in_force",
  "issued_date": "1984-02-28",
  "in_force_date": "1984-02-28",
  "url": "https://m.knesset.gov.il/EN/activity/documents/BasicLawsPDF/BasicLawTheJudiciary.pdf",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Chapter A: Basic Provisions Power of adjudication",
      "content": "(a) The following courts are vested with the power of adjudication: (1) The Supreme Court; (2) A district court; (3) A magistrates' court; (4) Another court designated by law as a court of law; In this law, \"judge\" - a judge of a court as aforesaid. (b) The power of adjudication is also vested in the following: (1) A religious court (beit din); (2) Another tribunal; (3) Another authority; and all as prescribed by law. (c) No court or tribunal shall be set up for a particular case. Independence"
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Independence",
      "content": "Whoever is vested with the power of adjudication shall not be subject to any authority regarding matters of adjudication, except for that of the law. Openness of deliberations"
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Openness of deliberations",
      "content": "A court shall hold its deliberations in public, unless it has been otherwise prescribed by law, or if the court has instructed otherwise in accordance with the law. Chapter B: The Judges Appointment of judges Nationality"
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "4.",
      "content": "(a) A judge shall be appointed by the President of the State, in accordance with the selection of the Committee for the Selection of Judges. (b) The Committee shall be made up of nine members, who are the President of the Supreme Court, two other justices of the Supreme Court chosen by their fellow justices, the Minister of Justice and another Minister assigned by the Government, two Members of the Knesset selected by the Knesset, and two representatives of the Bar Association, selected by the National Council of the Association. The Minister of Justice shall be the Chairperson of the Committee. (c) The Committee may operate even if the number of its members has decreased, as long as it is no less than seven. Only an Israeli citizen can be appointed as judge. Declaration of allegiance"
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Declaration of allegiance",
      "content": "Whoever is appointed as judge, shall make a declaration of allegiance before the President of the State. And these are the words of the declaration: \"I pledge myself to keep allegiance to the State of Israel and its laws, to administer justice fairly, to avoid subverting justice, and to avoid demonstrating favor\". Tenure of office (Amendment No. 2)"
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Tenure of office",
      "content": "The service of a judge shall begin upon his declaration of allegiance, and shall not terminate save in the event of one of the following: (1) His retirement on pension; (2) His resignation; (3) His election or appointment to one of the positions whose holders are prevented from being candidates for the Knesset; (4) Upon a decision by the Committee for the Selection of Judges, proposed by the Chairperson of the Committee, the Ombudsman of Judges, or the President of the Supreme Court, and which was adopted by a majority of seven members at least. (5) Upon a decision of a Disciplinary Court. A judge who retired"
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "A judge who retired",
      "content": "A judge who retired on pension may be appointed to the position of a judge, for a period, in a manner and under conditions prescribed by law. Restriction on change of position"
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Restriction on change of position",
      "content": "(a) A judge shall not be permanently transferred from the court where he is serving to a court elsewhere, save with the consent of the President of the Supreme Court, or pursuant of a decision of a Disciplinary Court. Salary and benefits"
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Salary and benefits",
      "content": "(b) A judge shall not be appointed to a substitute position in a court of a lower instance, save with his consent. (a) The salaries of judges, and other payments made to them during or after their tenure of office, or to their heirs after their death, shall be prescribed by law, or by a decision of the Knesset, or of one of its Committees empowered by the Knesset for this purpose. (b) No decision shall be taken designed to reduce the salaries of judges only. Singularity of office"
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Singularity of office",
      "content": "A judge shall not engage in an additional occupation, and shall not perform a public post, save in accordance with the law, or with the consent of the President of the Supreme Court, and the Minister of Justice. Criminal proceedings"
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Criminal proceedings",
      "content": "(a) A criminal investigation shall not be opened against a judge, save with the consent of the Attorney General, and an indictment shall not be served against a judge save by the Attorney General. (b) A criminal charge shall not be tried against a judge save in a district court made up of three judges, unless the judge has agreed that the charge shall be tried in the usual manner. (c) The provisions of this article shall not apply to categories of offences prescribed by law. (a) A judge is subject to the jurisdiction of a Disciplinary Court. Disciplinary proceedings"
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Disciplinary proceedings",
      "content": "Suspension (Amendment No. 1)"
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Suspension",
      "content": "(b) The Disciplinary Court shall be made up of judges, or retired judges appointed by the President of the Supreme Court. (c) Provisions regarding the grounds for a disciplinary proceeding, the manner of filing complaints, the make-up of the bench, the powers of the Disciplinary Court, and the disciplinary measures it may impose, shall be prescribed by law. The rules of the proceedings shall be in accordance with the law. Should a complaint be made against a judge, or should a criminal investigation be opened against him, or should an indictment be filed against him, the President of the Supreme Court is entitled to suspend the judge for a period that he shall determine. Chapter C: The Courts The Supreme Court"
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "Chapter C: The Courts The Supreme Court",
      "content": "(a) The seat of the Supreme Court is Jerusalem. (b) The Supreme Court shall hear appeals against verdicts and other rulings of the District Courts. (c) The Supreme Court shall also sit as a High Court of Justice. When so sitting it shall deliberate matters, in which it deems it necessary to provide relief for the sake of justice, and are not under the jurisdiction of another court or tribunal. (d) Without prejudice to the generalness of the provisions in clause (c), the Supreme Court sitting as High Court of Justice, is authorized - (1) To grant orders for the release of persons unlawfully detained or imprisoned; (e) (2) To grant orders to state authorities, to local authorities, to their officials, and to other bodies and persons holding public office under the law, to act or refrain from acting while lawfully exercising their duties, and if they were unlawfully elected or appointed - to refrain from acting; (3) To grant orders to courts, to tribunals, and to bodies and persons with judicial or quasi-judicial authority under the law - save courts that this law relates to, and save religious courts - to deal with a certain matter, or avoid dealing with, or continue to deal with a certain matter, and cancel a proceeding held or a ruling given unlawfully; (4) To grant orders to religious courts to deal with a certain matter on the basis of their jurisdiction, or to avoid dealing or continuing to deal with a certain matter that falls outside their jurisdiction, provided that the court shall not entertain a request under this paragraph, should the appellant not have raised a question of jurisdiction at the earliest opportunity that he had; and if he did not have a reasonable opportunity to raise the question of jurisdiction before the ruling by the Religious Court, the court is entitled to quash a proceeding that took place, or a ruling that was given by the Religious Court without authority. Other powers of the Supreme Court shall be prescribed by law. Other courts"
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Other courts",
      "content": "The establishment, powers, seat and jurisdiction areas of district courts, magistrates' courts, and other courts shall be in accordance with the law. Appeal"
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Appeal",
      "content": "A verdict of a court in the first instance, may be appealed by right, save a verdict of the Supreme Court. Additional hearing"
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Additional hearing",
      "content": "A matter adjudicated by the Supreme Court by a bench of three, may be heard again in the Supreme Court by a bench of five or more, on grounds prescribed by law, and in a manner prescribed in accordance with the law. Retrial"
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Retrial",
      "content": "In a criminal matter, in which a final verdict has been given, a retrial may take place on grounds prescribed by law, and in a manner prescribed in accordance with the law. Established rule"
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Established rule",
      "content": "(a) A rule established in a court shall guide a court of a lower instance. (b) A rule established in the Supreme Court shall bind every court, save the Supreme Court. Registrars"
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Registrars",
      "content": "A court may have a registrar, whether he is or is not a judge. Chapter D: Miscellaneous Provisions Stability of the law"
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Chapter D: Miscellaneous Provisions Stability of the law",
      "content": "Emergency regulations do not have the power to change this law, to temporarily suspend its validity, or to subject it to conditions. Provisions in the law"
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Provisions in the law",
      "content": "In the following matters provisions shall be prescribed by law: (1) The manner of selecting the members of the Committee for the Selection of Judges, and the duration of their tenure of office; (2) Qualifications for serving as judges at the various levels; Provisions to be prescribed in accordance with the law"
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "prescribed in accordance with the law",
      "content": "(3) The manner of appointment of the President of the Supreme Court, the Deputy to the President of the Supreme Court, the President and Deputy President of a District Court and of a Magistrates' Court; (4) The conditions and procedures for terminating the service of a judge; (5) The manner of appointing an acting judge in another court, and the reassignment of a judge, temporarily or permanently, from the place where he serves to a court in a different location; (6) The procedures for suspending a judge, and a review of the suspension; (7) The cases which different levels of courts shall deal with, with a bench of a single, three or more judges; (8) The manner of determining which judge or judges shall hear a particular case. In the following matters provisions shall be prescribed in accordance with the law: (1) The administrative procedures of the courts, their determination, and the responsibility for their implementation; (2) The work procedures of the Committee for the Selection of Judges; (3) The manner in which a judge resigns; (4) the manner in which the registrar of a court is appointed, and his powers; (5) The number of judges, who will serve in the various levels and locations of the courts."
    }
  ],
  "definitions": []
}