{
  "id": "basic-law-nation-state-2018",
  "type": "statute",
  "title": "חוק יסוד: ישראל – מדינת הלאום של העם היהודי",
  "title_en": "Basic Law: Israel - The Nation State of the Jewish People, 5778-2018",
  "short_name": "BL-NS",
  "status": "in_force",
  "issued_date": "2018-07-19",
  "in_force_date": "2018-07-19",
  "url": "https://m.knesset.gov.il/EN/activity/documents/BasicLawsPDF/BasicLawNationState.pdf",
  "provisions": [
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "1.",
      "content": "(a) The Land of Israel is the historical homeland of the Jewish People, in which the State of Israel was established. (b) The State of Israel is the nation state of the Jewish People in which it realizes its natural, cultural, religious and historical right to self-determination. (c) The realization of the right to national selfdetermination in the State of Israel is exclusive to the Jewish People. (a) The name of the State is \"Israel\" (b) The State flag is white, with two light-blue stripes close to the edges, and a light-blue Star of David in the centre. (c) The State emblem is a seven-branched menorah with olive leaves on both sides, and the word \"Israel\" beneath it. (d) The national anthem is \"Hatikvah\". (e) Details regarding the State symbols shall be prescribed by law. The capital of the State"
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "The capital of the State",
      "content": "The complete and united Jerusalem is the capital of Israel. Language"
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Language",
      "content": "(a) Hebrew is the language of the State. (b) Arabic has a special status in the State. Regulation of the use of Arabic in state institutions or in contacts with them shall be prescribed by law. (c) Nothing in this article shall compromise the status given to the Arabic language in practice, before this basic-law came into force. Ingathering of the exiles"
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Ingathering of the exiles",
      "content": "The State shall be open to Jewish immigration, and the ingathering of the exiles. The connection to the Jewish People"
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "The connection to the Jewish People",
      "content": "(a) The State shall strive to secure the welfare of members of the Jewish People and of its citizens, who are in straits and in captivity, due to their Jewishness or due to their citizenship. (b) The State shall act in the Diaspora, to strengthen the affinity between the State and members of the Jewish People. (c) The State shall act to preserve the cultural, historical, and religious heritage of the Jewish People among Jews of the Diaspora. Jewish settlement"
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Jewish settlement",
      "content": "The State views the development of Jewish settlement as a national value, and shall act to encourage and promote its establishment and consolidation. Official calendar"
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Official calendar",
      "content": "The Hebrew calendar is the official calendar of the State, and side by side with it, the Gregorian calendar shall be used as an official calendar. The use of the Hebrew calendar and the Gregorian calendar shall be prescribed by law. Independence Day and memorial days"
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Independence Day and memorial days",
      "content": "(a) Independence Day is the official national holiday of the State. (b) Memorial Day for the Fallen in Israel's Wars, and the Remembrance Day for the Holocaust and Martyrdom, are official memorial days of the State. Days of rest and statutory holidays"
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Days of rest and statutory holidays",
      "content": "The Sabbath and the Jewish holidays are the established days of rest in the State. Those who are not Jewish have the right to keep days of rest on their days of rest and holidays. Details regarding this matter shall be prescribed by law. Rigidity"
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Rigidity",
      "content": "This basic-law may not be changed save by means of a basiclaw, adopted by a majority of the Knesset Members."
    }
  ],
  "definitions": []
}