{
  "id": "basic-law-the-state-economy-1975",
  "type": "statute",
  "title": "חוק יסוד: משק המדינה",
  "title_en": "Basic Law: The State Economy, 5735-1975",
  "short_name": "BL-ECON",
  "status": "in_force",
  "issued_date": "1975-07-21",
  "in_force_date": "1975-07-21",
  "url": "https://m.knesset.gov.il/EN/activity/documents/BasicLawsPDF/BasicLawStateEconomy.pdf",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Taxes, mandatory loans and fees (Amendment No. 1)",
      "content": "(a) (b) Taxes, mandatory loans and other mandatory payments, shall not be introduced, and their rates shall not be changed, save by law, or on its basis. The same applies to fees. Taxes, mandatory loans, other mandatory payments and fees that are paid to the State treasury, and whose rates have not been prescribed in the law itself, and there is no provision in the law to the effect that their prescription in regulations requires the approval of the Knesset, or of one of its Committees, their prescription in regulations requires prior approval, or approval within the period laid down by law - by means of a Knesset resolution, or a decision by one of its Committees authorized for this purpose by the Knesset. State assets"
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "State assets",
      "content": "Transactions in state assets, the acquisition of rights, and the assumption of liabilities in the name of the State, shall be performed by someone authorized to do so by law, or on the basis of the law. The State budget (Amendments No. 1, 2, 7, 8, 9, 12 & 13)"
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "The State budget 2, 7, 8, 9, 12 & 13)",
      "content": "(a) (b) (1) The State budget shall be prescribed by law. (2) The budget shall be for one year, and shall present the Government's expected and planned expenditure. (1) (a) The Government shall lay the Budget Bill on the Knesset's table at a time appointed by the Knesset Finance Committee, but no later than 60 days before the beginning of the financial year, and no earlier than six months before the beginning of the financial year. (b) (1) Despite what is said in sub-clause (a), should circumstances exist as mentioned in article 36a(b) in BasicLaw: The Knesset, and the Budget Law was not adopted before the beginning of the financial year, the Government shall lay the Budget Bill on the Knesset’s table at a time appointed by the Knesset Finance Committee, but no later than 60 days before the appointed day, as laid down in that article, and with regards to this period Jewish holidays and holiday eves, in accordance with their meaning in that article, shall not be counted. (2) (c) Should what is said in sub-clause (1) be realized, and under the said circumstances only, the Government is entitled to lay on the Knesset table, together with the Budget Bill as stated in sub-clause (1), a budget bill for the following budget year, even if the submission date is earlier than six months before the beginning of that budget year. (2) The Budget Bill shall be detailed. (3) The detailed budget proposal of the Defense Ministry, and the detailed budget proposal of defense bodies that shall be determined with regards to this matter by law, shall not be laid on the Knesset table, but on the table of a joint committee of the Knesset Finance Committee and Foreign Affairs and Defense Committee. (4) The Finance Bill shall be accompanied by an estimate of the sources for financing it. If necessary, the Government is entitled to submit an additional budget bill in the course of the financial year. Should the government foresee that the Budget Law shall not be approved before the beginning of the Financial Year, it is entitled to submit an Interim Budget Bill. Multi-annual budget (Amendment No. 4)"
    },
    {
      "provision_ref": "sec3a",
      "section": "3a",
      "title": "Multi-annual budget",
      "content": "(e) Every year, the Minister of Finance shall submit a report on the implementation of the State Budget to the Knesset. Details shall be prescribed by law. (a) Towards every financial year the Government shall prepare a multi-annual budget that shall include the Budget Bill for the coming year, as well as a budget plan for the following two consecutive years. Convergence apparatus (Amendment No 13) 3a1. (b) The Government shall lay on the Knesset table the Multi-Annual Budget Program together with the Budget Bill. (c) Every Budget Bill submitted by the Government to the Knesset shall be based on the Multi-Annual Budget Program that was prepared and laid on the Knesset table on the basis of this article in the previous year. (a) Once the Government has laid a budget bill on the Knesset table, as stated in article 3(b)(1)(b)(2) (in this article – the budget year), the following provisions shall apply: (1) In the Budget Law for the budget year an adjustments budget will be prescribed whose rate and provisions for the matter of its use, shall be laid down by law (in this article – Adjustments Budget). The Government shall submit its proposal for the use of the adjustments budget for the approval of the Knesset Finance Committee; (2) The Government, on the basis of the proposal of the Minister of Finance, shall submit to the Knesset, by November 1 of the year preceding the budget year, and no earlier than October 15 in the year that preceded the budget year, a report on the matter of the existence or nonexistence of an expenditure difference or a deficit difference that are expected in the budget year (in this article – Differences Report). Instructions on the matter of the submission of the Differences Report, and the details included in it, shall be laid down by law; (3) The Minister of Finance shall report to the Knesset Finance Committee, no later than 60 days before the submission of the Differences Report, about the economic and fiscal trends expected in the course of the financial year; (4) Should it be expected that in the course of the budget year there will be an expenditure difference or a deficit difference according to the Differences Report, and according to the said report use of the adjustments budget will not cover the full difference as stated, the Minister of Finance shall submit for the Government’s approval, together with the Differences Report, a plan for covering the difference balance (in this article – Balancing Plan). Provisions for the matter of preparing a balancing plan, and its details, shall be laid down by law. The Government shall approve and submit to the Knesset and the Knesset Finance Committee, the Balancing Plan, together with the approval of the Differences Report; (5) Should the actions based on the Balancing Plan be performed by December 1 of the year that preceded the budget year, and no deficit difference or expenditure difference remains, the Government shall approve this in a decision it shall deliver by the said date, and shall lay its approval on the Knesset table by December 1, in the year that preceded the budget year; (6) Should no actions have been taken in accordance with the Balancing Plan, or only part of them were performed by December 1 in the year that preceded the budget year, and a deficit difference, or expenditure difference remains, the following provisions shall apply, as applicable: (7) (a) Should a deficit difference remain – the government expenditure sum permitted under the Budget Law for the budget year shall be reduced by the remaining deficit difference. The Government, in accordance with the proposal of the Minister of Finance, shall bring for the approval of the Knesset Finance Committee, a plan to reduce the permitted government expenditure, in accordance with this paragraph, by December 1 in the year that preceded the budget year; (b) Should an expenditure difference remain – the Government, in accordance with the proposal of the Minister of Finance, shall bring for the approval of the Knesset Finance Committee a plan to reduce the expenditure articles in the Budget Law for the budget year, in order to cover the remaining expenditure difference, by December 1 in the year that preceded the budget year; (c) The provisions relating to the matter of the plan that shall be submitted in accordance with clause (a) or (b), and the approval by the Knesset Finance Committee, shall be laid down by law. The Knesset Finance Committee is entitled to propose to the Minister of Finance, changes in the plan for reducing the government expenditure that is permitted as stated in paragraph (6)(a) or (b), until December 15 in the year that preceded the budget year. Should the Committee propose as stated, the Government shall submit for the approval of the Committee, after it has weighted the proposals of the Committee as stated, a plan for the reduction of the permitted Government expenditure by December 24 in the year that preceded the budget year; (b) (8) Should the Knesset Finance Committee fail to approve the plan submitted by the Government in accordance with paragraph 6(a) or (b), or in accordance with paragraph (7), the expenditure sums in the articles of the budget in the Budget Law, shall be reduced equally to the level of the remaining deficit difference, or expenditure difference as stated in article (6), as applicable, in order to cover the remaining difference; (9) The Knesset Finance Committee is entitled to lay on the Knesset table its conclusions from its deliberations, as stated in paragraphs (1), (3), (4) and (6) to (8). The instructions for the deliberation on this matter in the Knesset shall be laid down by law. In this article – “Deficit Difference” – the difference between the deficit forecast for the budget year, to the permitted deficit sum for the budget year, as determined by law; “Expenditure Difference” – the difference between the Government expenditure forecast for the budget year, and the approved sum of the Government expenditure for the budget year, as determined by law. Non-adoption of the Budget Law (Amendments Nos. 5, 8,10 and temporary provision & 11 and temporary provision."
    },
    {
      "provision_ref": "sec3b",
      "section": "3b",
      "title": "8,10 and temporary provision & 11 and temporary provision.",
      "content": "(a) Should the Budget Law fail to be adopted before the beginning of the financial year, the following provisions shall apply to continuation budget year: (1) The Government shall be entitled to spend expenditures, as detailed below: (a) Every month, a sum equal to one twelfth of the permitted government expenditure for the previous year, or of the ceiling of the government expenditure for the previous year, which shall be linked to the rate of the population growth, whichever is lower; (2) (3) (Amendments No. 10 and temporary measure, & No. 11 and temporary measure) (b) Expenditure, which is conditioned on income, in accordance with provisions to be prescribed by law; (c) Expenditure of business enterprises, which operated in the course of the previous financial year, in accordance with provisions to be determined by law; (d) The return of principal debts, which is not the return of debts, as stated, to the National Insurance Institute; The Government shall be entitled to assume commitments within the limits of the sums as detailed below, as long as these commitments shall not increase the expenditure in that year beyond the expenditure sum in the continuation budget: (a) The sum of the authorization to undertake commitments, in accordance with instructions that shall be prescribed by law; (b) The sum of the expenditure in the continuation budget, the sum for expenditure conditioned on income, and the sum for the expenditure of business enterprises, as stated in sub-paragraphs (a) to (c) and (e) of paragraph (1), in accordance with instructions that shall be prescribed by law; (c) A sum left over, that remained in the articles of the budget in the previous Budget Law, in accordance with instructions that shall be prescribed by law. The Government shall be entitled to fill positions, by a number that shall not surpass the number of positions specified in the previous Budget Law. (a1) Expired (a2) Expired (b) Funds on the basis of clause (a)(1)(a) to (c), shall be earmarked first of all to fulfilling the State's commitments by force of laws, contracts and treaties. The remainder shall be used by the Government only to implement vital services, and activities that were included in the previous Budget Law, including those added by means of budgetary changes (in this clause – vital services and previous activities). Government commitments, in accordance with clause (a)(2) shall be only for vital services and previous activities. (Amendments No. 10 and temporary measure, & No. 11 and temporary measure) (b1) A plan including the expected and planned detailed government expenditures, according to this article, shall be laid by the Ministry of Finance on the Government table, and shall be submitted to the Knesset Finance Committee no later than a month from the beginning of the year of the continuation budget. The detailed expenditures of the Ministry of Defense, and the security bodies, shall be laid on the table of the Joint Committee of the Knesset Finance Committee, and Foreign Affairs and Defense Committee, as defined in article 18 of the Basis of the Budget Law 5745-1985. The Minister of Finance shall report to the Knesset Finance Committee, once a month, of the Government expenditures, in accordance with the said plan. (c) This article is not to be changed save by a majority of the Knesset Members. (d) In this article – “Government expenditure” – the net government expenditure, including the granting of credit, and less return of principal debts only, as long as it is not return of debts, as stated, to the National Insurance Institute; “Permitted government expenditure”, for a particular financial year – the sum of permitted government expenditure according to the Budget Law for that year, and if a budget law has not been adopted for that year – the sum of the permitted government expenditure according to this Basic Law; “The expenditure sum of the continuation budget” – the total annual sum of the government expenditure as stated in clause (a)(1)(a); “The rate of population growth” – the average rates of population growth in Israel, which was published by the Central Bureau for Statistics in the three years that preceded the year previous to the continuation budget; “Continuation budget year” – a financial year, which until its beginning, no budget law was adopted for that year, and if a budget was adopted during that year – that part of the financial year from the beginning of the year, and until the adoption of the Budget Law as stated; “The ceiling of the government expenditure”, for a particular financial year – the maximal sum of the government expenditure which may be provided, by law, in the Budget Law, less the sum of the government expenditure in that year, which is not taken into account as part of the maximal government expenditure which may be prescribed by law in the Budget Law in the following year. Legislation requiring a budget (Amendment No. 6)"
    },
    {
      "provision_ref": "sec3c",
      "section": "3c",
      "title": "Legislation requiring a budget (Amendment No. 6)",
      "content": "(a) A budgetary bill shall not be adopted by the Knesset, save by the votes of at least 50 Members of the Knesset. The said majority is required in first reading, in second reading, and in third reading. However, should a bill turn into a budgetary bill after the first reading, the said majority is required in second reading, and in third reading. (b) A budgetary reservation shall not be adopted by the Knesset save by the votes of at least 50 Members of the Knesset. Should a budgetary reservation to a bill be adopted, the Bill shall not be approved by the Knesset in third reading, save by the votes of at least 50 Members of the Knesset. (c) In relation to this article, the determination of the budgetary cost of a bill or reservation shall be performed by one of the Knesset Committees deliberating that Bill or reservation (hereafter - the Committee). The Committee shall determine the budgetary cost, on the basis of the evaluation of the Minister of Finance, or anyone authorized by him for this purpose, unless it has been proven, to its satisfaction, on the basis of some other evaluation submitted to it, that the budgetary cost is different from the estimation of the Minister of Finance. evaluations on the basis of this article shall be submitted with attached figures and estimates. (d) In this article \"A budgetary bill\" - a bill to which all the following apply: (1) It was submitted by someone other than the Government; (2) Its implementation involves a budgetary cost of 5 million NIS or more, in any given budget year; (3) The Government did not approve the budgetary cost; \"A budgetary reservation\" - a reservation to a bill, in which all the following apply: (1) Its implementation involves a budgetary cost of 5 million NIS or more, in any given budget year; (2) The Government did not approve the budgetary cost; \"Budgetary cost\" - an expenditure or a commitment for expenditure from the State Budget, or a diminution of State revenue, even if the aforesaid expenditure or reduction is accompanied by a reduction of expenditure or commitments for expenditure from the State Budget, or an increase of the state revenue; \"Expenditure from the State budget\", \"a reduction of State revenue\" - including expenditure from the budget of a budgeted body, or a reduction of the revenues of a budgeted body; \"A budgeted body\" - as defined in article 21 of the Foundations of the Budget Law, 5745-1985. (e) The sums specified in the definitions of \"budgetary bill\" and \"budgetary reservation\" in clause (d) shall be updated on 1 January of every year, on the basis of the rate of change in the consumer price index published by the Central Bureau of Statistics. (f) The provisions of this article shall not apply to a bill concerning the dissolution of the Knesset, and the holding of elections. Currency bills and coins"
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Currency bills and coins",
      "content": "The printing of currency bills and the minting of coins that shall serve as legal tender, as well as the issue thereof, shall be performed in accordance with the law. Control (Amendment No. 3)"
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Control (Amendment No. 3)",
      "content": "The State economy shall be subject to the inspection of the State Comptroller."
    }
  ],
  "definitions": []
}