{
  "id": "basic-law-the-president-1964",
  "type": "statute",
  "title": "חוק יסוד: נשיא המדינה",
  "title_en": "Basic Law: The President of the State, 5724-1964",
  "short_name": "BL-PRES",
  "status": "in_force",
  "issued_date": "1964-06-16",
  "in_force_date": "1964-06-16",
  "url": "https://m.knesset.gov.il/EN/activity/documents/BasicLawsPDF/BasicLawThePresident.pdf",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Status",
      "content": "The State is headed by a President. Place of residence"
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "Place of residence",
      "content": "The place of residence of the President of the State is Jerusalem. Election and term of office (Amendments Nos. 2 & 5"
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Election and term of office (Amendments Nos. 2 & 5",
      "content": "(a) The President of the State is elected by the Knesset for seven years. The term of office shall be calculated on the basis of the Hebrew calendar. (b) The President of the State shall serve for a single term of office only. Eligibility (Amendment No. 5)"
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Eligibility",
      "content": "Every Israeli citizen, who is a resident of Israel, is eligible to be a candidate for the office of President of the State. Date of election (Amendment No. 8)"
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Date of election",
      "content": "The election of the President of the State shall be held no earlier than ninety days, and no later than thirty days before the expiration of the term of the serving President. Should the position of the President of the State fall vacant before the expiration of his term of office, the election shall be held within forty-five days from the day on which his position fell vacant. The Speaker of the Knesset, in consultation with the Deputy Speakers, shall set the election day, and shall inform all the Members of the Knesset in writing thereof, at least three weeks in advance. Should the date of the election fall outside one of the Knesset sessions, the Speaker of the Knesset shall convene the Knesset for the purpose of electing the President of the State. nomination of candidates (Amendment No. 8)"
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "nomination of candidates",
      "content": "(a) (b) Voting"
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Voting",
      "content": "(1) The nomination of a candidate for the President of the State shall be submitted in writing to the Speaker of the Knesset, together with the written consent of the candidate, on the fourteenth day before the election day. A Member of the Knesset shall not participate in the nomination of more than one candidate. (2) Whoever is nominated by at least ten Members of the Knesset as a candidate shall be a candidate for the President of the State, unless the number of nominators fell below ten due to the deletion of the name of a Knesset Member as stated in paragraph (3). (3) Should a Member of the Knesset be party to nominating more than one candidate, the name of the Knesset Member shall be deleted from the list of the nominators of all the candidates who he nominated. Should the number of nominators of a candidate fall below ten due to the deletion of a name from the list of nominators, a Member of the Knesset who was not party to any nomination may add his name to the list of nominators of that candidate, no later than eight days before the election day. The Speaker of the Knesset shall inform all the Members of the Knesset in writing, no later than seven days before the day of the election, of every candidate who was nominated, and shall announce the candidates at the opening of the sitting at which the election is to be held. The election of the President of the State shall be by secret ballot at a Knesset sitting to be dedicated exclusively to this matter. Election by a majority of votes (Amendments Nos. 7 & 9) Declaration of allegiance"
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "8.",
      "content": "(a) Should there be two candidates or more, the candidate who received the votes of a majority of the Knesset Members – he is the one elected. Should no candidate receive such a majority, a second ballot is to be held. In the second vote only the two candidates who received the votes of the largest number of Knesset Members in the first vote shall stand for election. The candidate who received a majority of the votes of the Knesset Members participating in the second vote, and who have voted for one of the candidates – shall be elected. Should two candidates receive an equal number of votes, the voting shall be repeated. (b) Should there be only one candidate, the voting is to be held in his favor or against him, and he shall be the person elected should the votes in his favor surpass the votes against him. Should the number of votes in his favor be equal to the votes against him, the voting shall be repeated. (c) Should a President fail to be elected on the basis of clause (b), a reelection shall take place within thirty days from the day of the voting on the basis of the provisions of articles 5 to 7 and this article. However, the nomination of a candidate on the basis of article 6(a) shall be submitted no later than seven days before the day of the election. The elected President shall make and sign the following declaration of allegiance before the Knesset: \"I pledge myself to bear allegiance to the State of Israel and to its laws, and to faithfully perform my duties as President of the State\". Making the declaration and commencement of office"
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Making the declaration and commencement of office",
      "content": "(a) The President-elect shall make his declaration upon the termination of the term of office of the previous President, or as close as possible beforehand, and shall begin to serve at the end of the term of office of the previous President. Responsibilities and powers (Amendments Nos. 3 & 6) 11 (b) Should the position of the President of the State fall vacant before the end of his term of office, the Presidentelect shall declare his allegiance as soon as possible after his election, and shall start to serve from the moment that he made his declaration. (a) The President of the State (1) Shall sign every law, other than laws relating to his powers; (2) Shall perform the duties assigned to him by BasicLaw: The Government; (3) Shall receive from the Government reports on its meetings; (4) Shall accredit the diplomatic representatives of the State, shall receive the credentials of diplomatic representatives sent to Israel by foreign states, shall empower the consular representatives of the State, and shall confirm appointments of consular representatives sent to Israel by foreign states; (5) Shall sign treaties with foreign states approved by the Knesset; (6) Shall carry out every responsibility assigned to him by law in connection with the appointment and removal from office of judges and other office holders. (b) The President of the State has the power to pardon offenders and modify sentences by reducing or commuting them. (c) The President of the State shall carry out any other responsibility, and hold every other power assigned to him by law. Countersignature (Amendments 3 & 6)"
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Countersignature",
      "content": "The signature of the President of the State on an official document, requires the countersignature of the Prime Minister, or of another minister assigned by the Government, except for a document connected with the formation of the Government or the dissolution of the Knesset. Immunity in performance of duties"
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Immunity in performance of duties",
      "content": "(a) The President of the State shall not be accountable to any court of law or tribunal for anything connected with his functions or powers, and shall be immune from any legal action on this account. (b) The President of the State is not obliged to disclose in giving evidence anything that came to his knowledge while performing his duties as President of the State. (c) The immunity of the President of the State on the basis of this article shall continue to apply also after he has ceased to be the President of the State. Immunity from criminal proceedings"
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Immunity from criminal proceedings",
      "content": "The President of the State shall not face criminal charges. The period during which the President of the State cannot be prosecuted for an offence by force of this article shall not be counted as part of the period of obsolescence of the said offence. Evidence 15 Should the President be required to give evidence, the evidence shall be taken at such place and time as shall be determined in agreement with him. Salary and other payments (Amendment No. 1)"
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Salary and other payments (Amendment No. 1)",
      "content": "The salary of the President of the State, and other payments made to him during his tenure of office, shall be determined by a decision of the Knesset, and it is entitled to authorize the Finance Committee for this purpose. Decisions on the basis of this article shall be published in the Official Gazette. Exclusivity of position"
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Exclusivity of position",
      "content": "(a) The President of the State shall not serve in a post and shall not fulfill any position other than his post and position as President of the State, unless the Knesset House Committee has agreed to it. (b) The President of the State is exempt from any mandatory service. Travel abroad"
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Travel abroad",
      "content": "The President of the State shall not leave the State boundaries save with the consent of the Government. Resignation (Amendment No. 10)"
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Resignation",
      "content": "The President of the State is entitled to resign from his office by submitting a letter of resignation to the Speaker of the Knesset. The letter of resignation need not be countersigned. The position of the President shall become vacant after the letter of resignation has reached the Speaker of the Knesset. Removal of the President from office"
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Removal of the President from office",
      "content": "(a) The Knesset is entitled, by means of a resolution, to remove the President of the State from office, should it decide that he is unworthy of his office due to conduct that is inappropriate for his status as President of the State. (b) The Knesset shall not remove the President of the State from office, save after a complaint was brought to the House Committee by at least twenty Members of the Knesset, and on the basis of a decision of the House Committee adopted by a majority of three quarters of the members of the Committee. The decision of the Knesset to remove the President from his office requires a majority of three quarters of its Members as well. Vacancy of the post for health reasons"
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Vacancy of the post for health reasons",
      "content": "(c) The House Committee shall not propose the removal of the President of the State from his office, unless he has been given the opportunity to refute the complaint on the basis of the procedure laid down by the Committee with the approval of the Knesset, and the Knesset shall not decide to remove the President of the State from his office save after he has been given the opportunity to have his say on the basis of the procedure laid down by the House Committee with the approval of the Knesset. (d) The President of the State is entitled to be represented before the House Committee and before the Knesset by his council, as long as a Member of the Knesset shall not serve as council of the President. The House Committee and the Knesset are entitled to invite the President of the State to be present during the deliberations on the basis of this article. (e) The Knesset deliberations on the basis of this article shall be held in a sitting designated to this matter alone, or in successive sittings designated as stated. The debate shall begin no later than twenty days after the decision of the House Committee. The Speaker of the Knesset shall inform all the Knesset Members in writing of the time of its beginning, at least ten days in advance. Should the beginning of the debate not occur during one of the Knesset sessions, the Speaker of the Knesset shall convene the Knesset in order to hold the debate. (a) The Knesset is entitled, in a resolution taken by a majority of its Members, to declare that for health reasons the President of the State is permanently unable to perform his duties. (b) The Knesset shall not adopt the said resolution, save in accordance with a proposal of the House Committee adopted by two thirds of its Members, on the basis of a medical opinion submitted according to rules laid down by the Committee."
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "adopted by two thirds of its Members, on the basis of a medical opinion submitted according to rules laid down by the Committee.",
      "content": "22.. (c) Should the Knesset adopt a resolution as aforesaid, the office of the President of the State shall become vacant from the day of the resolution. (a) The President of the State shall temporarily cease to perform his duties, and exercise his powers - (b) (1) Should he leave the borders of the State - from the time of his departure until his return; (2) Should he notify the House Committee that he is temporarily unable to perform his duties, and the House Committee has approved his notification by a majority of the votes - from the approval of his announcement until the end of the period, which the Committee has fixed, or until the President of the State has notified the House Committee that he is no longer unable to perform his duties, whichever is the earlier date; (3) Should the House Committee decide by a majority of two thirds of its members, on the basis of a medical opinion submitted in accordance with the rules prescribed by the Committee, that for health reasons the President of the State is temporarily unable to perform his duties - from the adoption of the decision until the end of the period fixed by the Committee in its decision, or until it has decided that the President is no longer unable to perform his duties. The House Committee shall not prescribe, in accordance with clause (a)(2) or (3), a period of over three months. It is entitled to prolong it, consecutively, for no more than three additional months. A prolongation of the period for above this period requires a resolution by the Knesset adopted by a majority of the Knesset Members, on the basis of a proposal by the House Committee. Acting President and substitute Notices in the Official Gazette"
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "23.",
      "content": "(a) Should the position of the President of the State be vacated, and as long as the new President of the State has not assumed office, the Speaker of the Knesset shall serve as Acting President of the State. (b) During the period that the President of the State has temporarily ceased to perform his duties and exercise his powers, the Speaker of the Knesset shall substitute for the President of the State. (c) While serving as Acting President of the State, or as the substitute of the President of the State, the Speaker of the Knesset shall perform the functions assigned to the President of the State by law and exercise the powers vested in the President of the State by law. (a) The Speaker of the Knesset shall publish a notice in the Official Gazette with regards to the following - (b) (1) The commencement of the service of the President of the State; (2) The vacating of the position of the President of the State; (3) The commencement of the service of the Speaker of the Knesset as the substitute of the President of the State, and the termination of this service, on the basis of article 22(a)(2) or (3). The Prime Minister shall publish a notice in the Official Gazette regarding the departure of the President of the State from the borders of the State. Stability of the law"
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Stability of the law",
      "content": "Notwithstanding the provisions of any other law, Emergency Regulations cannot change, temporarily suspend, or condition this law. Repeal"
    },
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Repeal",
      "content": "(a) (b) Transitional provisions"
    },
    {
      "provision_ref": "sec27",
      "section": "27",
      "title": "Transitional provisions",
      "content": "The following are repealed - (1) Articles 2(c), 6 and 7 of the Transition Law, 57091949; (2) The Office of the President of the State Law, 5712-1951. The Law for Determining the Salaries of the President of the State, the Members of the Government, and the Chief Rabbis of Israel, 5711-1950, shall no longer apply to the salary of the President of the State, or to the payments due to him or his heirs. The President of the State elected by the Knesset on 27 Iyar 5723 (21 May, 1963), shall be considered to have been elected on the basis of this law, and to have served in accordance with it."
    }
  ],
  "definitions": []
}