{
  "id": "basic-law-the-knesset-1958",
  "type": "statute",
  "title": "חוק יסוד: הכנסת",
  "title_en": "Basic Law: The Knesset, 5718-1958",
  "short_name": "BL-KNS",
  "status": "in_force",
  "issued_date": "1958-02-12",
  "in_force_date": "1958-02-12",
  "url": "https://m.knesset.gov.il/EN/activity/documents/BasicLawsPDF/BasicLawTheKnesset.pdf",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "The essence",
      "content": "The Knesset is the house of representatives of the State The location"
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "The location",
      "content": "The seat of the Knesset is Jerusalem The composition"
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "The composition",
      "content": "Upon its election the Knesset shall consist of one hundred and twenty Members. The electoral system"
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "The electoral system",
      "content": "The Knesset shall be elected in general, national, direct, equal, secret, and proportional elections, in accordance with the Knesset Election Law. This article may not be changed save by a majority of the Knesset Members. The right to vote"
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "The right to vote",
      "content": "Every Israeli citizen aged eighteen or over, is eligible to vote in elections to the Knesset, unless a court of law has deprived him of this right in accordance with the law. The Elections Law shall determine when a person shall be considered to be eighteen years of age for the purpose of exercising the right to vote in elections to the Knesset. The right to submit a list of candidates (Amendments Nos. 19 and 21)"
    },
    {
      "provision_ref": "sec5a",
      "section": "5a",
      "title": "list of candidates and 21)",
      "content": "A list of candidates for the Knesset shall be submitted by a party only. The manner for association and registration of parties, and the conditions for submitting a list of candidates, shall be prescribed by law. The right to be elected (Amendments Nos. 8, 10, 22, 26 and 47)"
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "The right to be elected 10, 22, 26 and 47)",
      "content": "(a) Every Israeli citizen, who on the day of the submission of a list of candidates, which includes his name, is twenty one years old and above, is entitled to be elected to the Knesset, unless a court of law has deprived him of this right by virtue of the law, or who has been sentenced, in a final verdict, to actual imprisonment for a period of over three months, and on the day of the submission of the list of candidates seven years have not lapsed from the day on which he finished serving the actual imprisonment, and if he was convicted of a serious terror offence, or a serious security offence, as prescribed by law, was sentenced, in a final verdict, to an actual prison sentence for a period of over seven years imprisonment, and on the day of the submission of the list of candidate 14 years have not lapsed from the day that he finished serving the actual imprisonment, unless the Chairperson of the Central Elections Committee determined that the offence for which he was sentenced, in the circumstances of the case, did not involve turpitude. (b) [Repealed] (c) A candidate to the Knesset, who has been sentenced as stated in clause (a), and whose verdict became final after the submission of the list of candidates, and before he started serving as a Member of the Knesset, shall be treated as someone, who has resigned from the list of candidates in which his name was included, or from his membership in the Knesset, as applicable, unless the Chairperson of the Central Elections Committee has determined that the offence for which he was convicted, under the circumstances of the case, does not involve moral turpitude. (d) A decision by the Chairperson of the Central Elections Committee in accordance with clauses (a) and (c) shall not be required if the court has ruled, under the law, that under the circumstances of the case, the offence involves moral turpitude. (e) For the purpose of this article – \"Actual imprisonment\" – the total periods of actual imprisonment, which the convicted person must serve consecutively, even if these were imposed in different sentences, including a suspended sentence that has been activated; \"Offense\" – any one of the offences for which he has been sentenced to actual imprisonment. Reservation to the candidacy of a Member of the Knesset, who withdrew from his parliamentary group (Amendments Nos. 12, 21 & 36)"
    },
    {
      "provision_ref": "sec6a",
      "section": "6a",
      "title": "parliamentary group 21 & 36)",
      "content": "(a) A Member of the Knesset, who withdrew from his parliamentary group and did not resign from his position soon after withdrawing, shall not be included in the following elections to the Knesset, in a list of candidates submitted by a party, which was represented by a parliamentary group in the outgoing Knesset. This provision shall not apply to the splitting of a parliamentary group under conditions prescribed by law. (b) For the purpose of this article – “Withdrawal from a parliamentary group” - including voting in the Plenum not in accordance to the position of the Parliamentary Group with regards to expressing confidence in the Government, or no-confidence in it. However, such a vote shall not be considered as a withdrawal if the Member of the Knesset has not received any return for his vote; “Return” – direct or indirect, as a promise or commitment for the future, including a promise for a place in a list of candidates for the Knesset, or the appointment of the Knesset Member himself, or another person, to some position. Who shall not be a candidate (Amendments Nos. 2, 21 & 33)"
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "candidate 21 & 33)",
      "content": "The following shall not be candidates to the Knesset: (1) The President of the State; (2) The two Chief Rabbis; (3) A judge; (4) A religious court judge (\"dayan\"); (5) The State Comptroller; (6) The Chief of Staff of the Israel Defense Forces; (7) Rabbis and clerics of other religions, holding paid office; (8) Senior civil servants and military officers of such ranks and positions as shall be prescribed by law; (9) Policemen and prison wardens of such ranks and positions as shall be prescribed by law; (10) Employees in corporations established by law of such ranks and positions as shall be prescribed by law. unless they have ceased to serve in that position or job, as stated, before the deadline for submitting lists of candidates for the Knesset, and should an earlier date be set by law, before the said date. Barring participation in elections (Amendments Nos. 9, 35, 39 & 46)"
    },
    {
      "provision_ref": "sec7a",
      "section": "7a",
      "title": "in elections 35, 39 & 46)",
      "content": "(a) A list of candidates shall not participate in elections to the Knesset, and a person shall not be a candidate in elections to the Knesset, should there be explicitly or implicitly in the goals or actions of the list, or the actions of the person, including his expressions, as applicable, one of the following: (1) Negation of the existence of the State of Israel as a Jewish and democratic state; (2) Incitement to racism; (3) Support for an armed struggle by an enemy state, or of a terrorist organization, against the State of Israel. (a1) For the purpose of this article a candidate, who sojourned illegally in an enemy state in the seven years that preceded the deadline for submitting lists of candidates, shall be considered someone, whose actions constitute support for an armed conflict against the State of Israel, as long as he has not proven otherwise. (b) A decision by the Central Elections Committee to the effect that a candidate is barred from participating in elections, must be approved by the Supreme Court. (c) A candidate shall make a declaration concerning this article. (d) Details regarding the deliberation in the Central Elections Committee, and the Supreme Court, and on the matter of the declaration in accordance with clause (c), shall be prescribed by law. Term of the Knesset"
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Term of the Knesset",
      "content": "The term of the Knesset shall be four years from the day that it was elected. Date of the elections to the 24th Knesset"
    },
    {
      "provision_ref": "sec8a",
      "section": "8a",
      "title": "Date of the elections to the 24th Knesset",
      "content": "[Expired] (Amendment No. 48 – temporary provision] Date of elections (Amendment No. 1)"
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Date of elections",
      "content": "The elections to the Knesset shall take place on the third Tuesday of the month of Heshvan in the year in which the term of the outgoing Knesset ended, but should the preceding year be a leap year, the elections shall take place on the first Tuesday of that month. Extending the term (Amendment No. 15)"
    },
    {
      "provision_ref": "sec9a",
      "section": "9a",
      "title": "Extending the term",
      "content": "(a) The Knesset shall not extend its term, save by means of a law, adopted by a majority of eighty Members of the Knesset, and should special circumstances exist that prevent holding the elections on their designated date. The extension period shall not exceed the time required by the said circumstances. The election date shall be determined by the said law. (b) Without detracting from the provisions of article 34. the Knesset is entitled, by a decision of a majority of its Members, to advance the date of the elections set according to clause (a), as long as the new date shall not be earlier than the date for holding the elections to the Knesset in accordance with article 9. Election day – a day of rest"
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "Election day – a day of rest",
      "content": "Election day shall be a day of rest, but transportation and other public services shall function as usual. Publication of election results (Amendment No. 20)"
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Publication of election results (Amendment No. 20)",
      "content": "The results of the elections shall be published in the Official Gazette within eight days of election day. Convening of the Knesset (Amendment No. 37)"
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Convening of the Knesset (Amendment No. 37)",
      "content": "The Knesset shall convene for its first sitting, after the publication of the election results, within fourteen days from the day of the elections to the Knesset, on a date prescribed by law, unless the law prescribed another close day due to a day of rest, holiday or memorial day, or due to proximity to one of them, or due to an intermediate day. Opening of Knesset (Amendments Nos. 27 & 37)"
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Opening of Knesset & 37)",
      "content": "[Repealed] The opening sitting (Amendment No. 23)"
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "The opening sitting",
      "content": "Arrangements for the opening session shall be prescribed by law, and shall express the nature of the State of Israel and its heritage. Declaration of allegiance of the Knesset Member (Amendments No. 23)"
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "allegiance of the Knesset Member",
      "content": "(a) The Member of the Knesset shall declare allegiance. And these are the words of the declaration: \"I pledge myself to bear allegiance to the State of Israel and to faithfully discharge my mission in the Knesset\". (b) Arrangements for the declaration shall be prescribed by law. Refrainment from declaration"
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Refrainment from declaration",
      "content": "Should the Speaker of the Knesset call upon the Member of the Knesset to make the declaration of allegiance, and the Member refrained from doing so, that Member shall not enjoy the rights of a Member of the Knesset as long as he has not made the declaration. Refrainment from declaration due to dual citizenship (Amendment No. 22)"
    },
    {
      "provision_ref": "sec16a",
      "section": "16a",
      "title": "declaration due to dual citizenship",
      "content": "Should a Member of the Knesset hold an additional citizenship that is not Israeli, and the laws of the state of which he is a citizen enables his release from this citizenship, he shall not declare allegiance until after he has done everything required of him to be released of it, and shall not enjoy the rights of a Member of the Knesset as long as he has not made the declaration. Immunity of Knesset Members"
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "Immunity of Knesset Members",
      "content": "Members of the Knesset shall have immunity. Details shall be prescribed by law. Inviolability of the Knesset buildings"
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Inviolability of the Knesset buildings",
      "content": "The Knesset buildings shall be inviolable. Details shall be prescribed by law. Procedures and the Rules of Procedure"
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Procedures and the Rules of Procedure",
      "content": "The Knesset shall determine its work procedures. In so far as the procedures have not been prescribed by law, the Knesset shall lay them down in the Rules of Procedure. As long as the procedures have not been prescribed as stated, the Knesset shall act in accordance with the custom and practices accepted by it. The Speaker and the Deputies (Amendments Nos. 24, 27, 34, 37 & 43)"
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "Deputies 27, 34, 37 & 43)",
      "content": "(a) The Knesset shall elect from among its members a Speaker and Deputy Speakers. Until the election of the Speaker of the Knesset, the Speaker of the outgoing Knesset shall continue to serve, should he have been reelected as a Member of the Knesset, and if he has not been reelected - the most veteran Knesset Member, who is not the Prime Minister, a minister or a deputy minister, shall serve as acting Speaker. In this article, \"most veteran\" – whoever has served in the Knesset for the longest period, consecutively or intermittently, and from among those with equal seniority – the eldest among them. (b) The Knesset is entitled to lay down in its Rules of Procedure reservations to the election of a Member of the Knesset to serve as Speaker of the Knesset, or Deputy Speaker of the Knesset. (c) The Knesset is entitled, by a decision of a majority of its Members, to suspend the Speaker of the Knesset or a deputy speaker of the Knesset, or to lay down restriction to their office. Details shall be prescribed by law. (d) The Knesset is entitled, by a decision of a majority of its members, or by a larger majority prescribed by law, to dismiss the Speaker of the Knesset or a deputy Speaker of the Knesset. Details shall be prescribed by law. Substitute Speaker of the Knesset, and Acting Speaker of the Knesset (Amendments Nos. 4, 24 & 27)"
    },
    {
      "provision_ref": "sec20a",
      "section": "20a",
      "title": "Knesset 24 & 27)",
      "content": "(a) Should the Speaker of the Knesset leave the confines of the State, a deputy Speaker of the Knesset shall act in his place, until the Speaker returns. (b) Should the Speaker of the Knesset notify the House Committee, or should the House Committee decide that for health reasons the Speaker of the Knesset is temporarily unable to perform his duties, or should the Speaker of the Knesset announce that he is temporarily unable to perform his duties, and the House Committee has approved his announcement, a deputy speaker shall perform his duties, until the Speaker of the Knesset shall inform the House Committee, or until the House Committee shall determine that he is no longer unable to perform his duties. (c) Should the post of the Knesset Speaker become vacant – because he has resigned or has passed away, or because the House Committee has determined that for health reasons, he is unable to regularly perform his duties – a deputy speaker shall serve as acting Knesset Speaker, until a new Speaker is elected by the Knesset. (c1) (1) Should the Speaker of the Knesset be suspended from his post by a decision in accordance with article 20(c), a deputy speaker shall serve as acting Speaker of the Knesset, until the suspension is revoked, or until the election of a new Speaker of the Knesset, as applicable. (2) Should the Speaker of the Knesset be removed from his post in a decision in accordance with article 20(d), a deputy speaker of the Knesset shall serve as acting Speaker of the Knesset until the election of a new Speaker. (d) The Deputy Speaker who is to serve as a substitute of the Knesset Speaker, or as acting Knesset Speaker shall be the Deputy elected for that purpose by the House Committee. Committees (Amendments Nos. 13, 14, 16 & 28)"
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "Committees 14, 16 & 28)",
      "content": "(e) While serving as substitute to the Speaker of the Knesset, or as acting Knesset Speaker, the Deputy Speaker shall serve in every position designated to the Speaker of the Knesset by law, and shall exercise every power vested in the Speaker of the Knesset by law. (f) The provisions of this article shall apply, mutatis mutandis, also if the circumstances described in clauses (a), (b), (c) or (c1) regarding the Speaker of the Knesset apply to whoever serves as a substitute to the Knesset Speaker, or an acting Knesset Speaker. (a) The Knesset shall select Permanent Committees from among its Members, and it is also entitled to select Committees for particular matters from among its Members. The tasks of the Committees, their powers and procedures, in so far as they are not prescribed by law, shall be laid down in the Rules of Procedure. (b) Provisions may be laid down in the Rules of Procedure regarding the authority of the Committees to summon an office holder or functionary in the Civil Service, a local authority, a religious council, a corporation established by law, or a government corporation, and to require him to provide information at his disposal on the activities of the body in which he serves, unless such disclosure constitutes a breach of the law, of a professional obligation, or of a fiduciary duty to which he is bound by law, and he shall be assured rights accorded witnesses in a court. The summons shall be issued by means of the Minister concerned, or with his knowledge, and in the case of someone, who is not in the Civil Service – by means of the head of the body in which the invitee serves. However, the Minister in charge, or the head of the body in which the invitee serves, is entitled to inform the Committee that he himself will appear in place of the invitee. (c) [Repealed] Knesset oversight of subsidiary legislation (Amendments Nos. 30 &.45)"
    },
    {
      "provision_ref": "sec21a",
      "section": "21a",
      "title": "subsidiary legislation &.45)",
      "content": "[Repealed – Amendment No. 45] Committees of Inquiry"
    },
    {
      "provision_ref": "sec22",
      "section": "22",
      "title": "Committees of Inquiry",
      "content": "The Knesset is entitled to appoint Committees of Inquiry, either by empowering one of its permanent Committees, or by selecting a committee from among its Members, in order to investigate matters determined by the Knesset. The powers and tasks of a Committee of Inquiry shall be determined by the Knesset. In every Committee of Inquiry there shall also be representatives of parliamentary groups that are not members of the Government, on the basis of the relative strength of the Parliamentary Groups in the Knesset. The status of a minister and a deputy minister, who are not Members of the Knesset (Amendments Nos. 42 and temporary provision, & 49)"
    },
    {
      "provision_ref": "sec23",
      "section": "23",
      "title": "Knesset (Amendments Nos. 42 and temporary provision, & 49)",
      "content": "The status of a minister or deputy minister, who are not Knesset Members, with regards to anything connected with the Knesset, is the same as that of a minister or deputy minister who are Members of the Knesset, but they shall not have the right to vote. Quorum (Amendment No. 6)"
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "Quorum (Amendment No. 6)",
      "content": "The Knesset shall hold debates and adopt resolutions with the participation of any number of Members, unless there is another provision on this matter in the law. Majority"
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "Majority",
      "content": "The Knesset shall adopt resolutions by a majority of the participants in the vote, with those abstaining not being counted among those participating in the vote. The voting procedures shall be laid down in the Rules of Procedure; and all this as long as there is no other provision in the law. Sittings"
    },
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Sittings",
      "content": "The sittings of the Knesset shall be held in the location of its seat, but under special circumstances the Speaker of the Knesset is entitled, after consulting his Deputies, to convene the Knesset elsewhere. Knesset sittings shall take place on weekdays. Openness (Amendment No. 17)"
    },
    {
      "provision_ref": "sec27",
      "section": "27",
      "title": "Openness",
      "content": "The Knesset shall meet publicly. Publication (Amendment No. 17) 28 The publication of the proceedings of Knesset sittings, and whatever was said in them, shall not be restricted, and shall not entail any criminal or civil liability."
    },
    {
      "provision_ref": "sec29",
      "section": "29",
      "title": "The publication of the proceedings of Knesset sittings, and whatever was said in them, shall not be restricted, and shall not entail any criminal or civil liability.",
      "content": "]Repealed Amendment No. 17["
    },
    {
      "provision_ref": "sec30",
      "section": "30",
      "title": "]Repealed Amendment No. 17[",
      "content": "]Repealed - Amendment No. 17["
    },
    {
      "provision_ref": "sec31",
      "section": "31",
      "title": "]Repealed - Amendment No. 17[",
      "content": "Provisions concerning the dates of Knesset sessions, and the convening of the Knesset out of session, shall be prescribed by law."
    },
    {
      "provision_ref": "sec32",
      "section": "32",
      "title": "Provisions concerning the dates of Knesset sessions, and the convening of the Knesset out of session, shall be prescribed by law.",
      "content": "Repealed by means of Amendment No. 31"
    },
    {
      "provision_ref": "sec33",
      "section": "33",
      "title": "Repealed by means of Amendment No. 31",
      "content": "Repealed by means of Amendment No. 29. Dissolution of the Knesset (Amendment No. 15"
    },
    {
      "provision_ref": "sec34",
      "section": "34",
      "title": "Dissolution of the Knesset (Amendment No. 15",
      "content": "The Knesset shall not decide to dissolve itself before the end of its term, save by the adoption of a law on this matter by a majority of the Knesset Members. Date of the elections after dissolution (Amendment No. 30)"
    },
    {
      "provision_ref": "sec35",
      "section": "35",
      "title": "Date of the elections after dissolution",
      "content": "The law concerning the dissolution of the Knesset shall contain a provision regarding the date of elections for the following Knesset, which shall be no later than five months from the day the law is adopted. Sessions (Amendments Nos. 5 & 29) Term of the Knesset after dissolution"
    },
    {
      "provision_ref": "sec36",
      "section": "36",
      "title": "Term of the Knesset after dissolution",
      "content": "Once the Knesset has decided to dissolve itself, the following Knesset shall continue to serve until the closest month of Heshvan after the termination of four years from its elections. Dissolution due to the failure to adopt the Budget Law [Amendments Nos. 30, 40, 48 (temporary provision), 50 (temporary provision) & 51]"
    },
    {
      "provision_ref": "sec36a",
      "section": "36a",
      "title": "provision), 50 (temporary provision) & 51]",
      "content": "(a) Should the Budget Law fail to be adopted within three months following the commencement of the financial year, the day following the termination of the said period (hereinafter – the determining date) shall be regarded as if the Knesset had decided to dissolve itself before the end of its term, and early elections shall be held on the last Tuesday before the end of 90 days from the determining date, unless the Knesset has decided by a majority of its Members, within five days of the determining date to hold the elections on a later date, due to the proximity of the elections date to a festival, holiday, or memorial day, but no later than 100 days after the determining date. (b) Notwithstanding the provisions of clause (a), once the President of the State has initiated proceedings for the formation of a new government in accordance with article 30 of Basic-Law: The Government, should the Knesset express confidence in the new Government on the basis of article 28 of Basic-Law: The Government, or should a law have been adopted concerning the dissolution of the Knesset, or should elections have been held for the Knesset, after the deadline for submitting the Budget Bill on the basis of article 3 of termination of the three months from the beginning of the financial year, the determining date as stated in clause (a) shall be the day after the end of three months from the beginning of the financial year, or the day after 145 days from the day the Government was formed, whichever is later. Should the Knesset Finance Committee decide, in accordance with article 3(b)(1) of Basic-Law: The State Economy, that the Budget Bill shall be laid on the Knesset table before the 85th day from the date of the formation of the Government, the determining day shall be the day after the 60 days from the day on which the Government laid the Bill. In counting the periods of 146 days, 85 days, and 60 days, as aforementioned, Jewish holidays, and holiday eves, as prescribed by law, shall not be counted. (c) [Expired] Continuity of the Knesset"
    },
    {
      "provision_ref": "sec37",
      "section": "37",
      "title": "Continuity of the Knesset",
      "content": "The outgoing Knesset shall continue to serve until the convening of the incoming Knesset. Extension of enactment validation"
    },
    {
      "provision_ref": "sec38",
      "section": "38",
      "title": "Extension of enactment validation",
      "content": "Any enactment the validity of which would have expired within the last two months of the term of the outgoing Knesset, or within four months after the Knesset decided to dissolve itself, or within the first three months of the term of the incoming Knesset – shall remain in force until the end of the said three months. Salary of Members of the Knesset"
    },
    {
      "provision_ref": "sec39",
      "section": "39",
      "title": "Salary of Members of the Knesset",
      "content": "Members of the Knesset shall receive a salary as prescribed by law. Resignation of a Member of the Knesset"
    },
    {
      "provision_ref": "sec40",
      "section": "40",
      "title": "Resignation of a Member of the Knesset",
      "content": "A Member of the Knesset is entitled to resign his position. The resignation shall be by means of a personal submission of the letter of resignation by the resigning Member to the Speaker of the Knesset, and if he is prevented from submitting it personally – by means of delivery thereof in a manner prescribed in the Rules of Procedure. The letter of resignation shall be signed on the day of the submission or delivery. Consequences of resignation (Amendment No. 41)"
    },
    {
      "provision_ref": "sec41",
      "section": "41",
      "title": "Consequences of resignation",
      "content": "The membership of a Knesset Member, who has submitted his resignation, in the Knesset shall end forty eight hours after the letter of resignation has reached the Speaker of the Knesset, unless he withdrew his resignation beforehand. Should the said period end on a day of rest, its termination shall be postponed until the following day that is not a day of rest, and all this as prescribed by law. The expiring of the service or candidacy of a Member of the Knesset (Amendment No. 33)"
    },
    {
      "provision_ref": "sec42",
      "section": "42",
      "title": "a Member of the Knesset (Amendment No. 33)",
      "content": "A Member of the Knesset, or a candidate for the Knesset, who has been appointed to one of the positions whose holders are barred from being candidates for the Knesset, his membership in the Knesset, or his candidacy to the Knesset, as applicable, shall terminate upon his election or appointment to one of the positions as stated. In this regard. \"Candidate for the Knesset\" – anyone whose name is included in the list of candidates for the Knesset, from the day the list was submitted until the day of the commencement of his term as a Member of the Knesset. Ending the membership of a Member of the Knesset (Amendments Nos. 7, 18, 26, 32 & 44)"
    },
    {
      "provision_ref": "sec42a",
      "section": "42a",
      "title": "Member of the Knesset 18, 26, 32 & 44)",
      "content": "(a) A Member of the Knesset, who has been convicted of a felony in a final verdict, and the court has ruled, upon its own initiative or at the request of the Attorney General, that the offence involves moral turpitude, his membership in the Knesset shall terminate on the day that the verdict became final, and it is immaterial whether the offence was committed while he was a Member of that Knesset, a member of a previous Knesset, or before he became a Member of the Knesset. (b) Clause (a) shall also apply to a Member of the Knesset whose verdict was finalized after he started to serve as a Member of the Knesset. A request by the Attorney General on the basis of clause (a) can be submitted as long as the verdict has not been finalized. The request shall be submitted to the court that issued the verdict, and if an appeal has been filed, to the court of appeal. (1) The Knesset is entitled, by a majority of 90 Members of the Knesset, to decide to terminate the membership of a Knesset Member if it has determined that what is said in article 7a(a)(2) or (3) regarding a candidate, applies to him, after that Knesset was elected. (2) A decision, as stated in paragraph (1), shall be adopted on the basis of a proposal by the House Committee, which was adopted by a majority of three quarters of its members, on the basis of a request of 70 Knesset Members, at least 10 of whom are Members of the Knesset in parliamentary groups that are not sides to agreements that require support of the Government. Suspension (Amendments Nos. 7, 26 & 38)"
    },
    {
      "provision_ref": "sec42b",
      "section": "42b",
      "title": "Suspension 26 & 38)",
      "content": "(3) The position of anyone whose membership in the Knesset was terminated on the basis of paragraph (1) shall be vacated 14 days from the day of the Knesset's decision, but in the period from the Knesset's decision to the day on which the membership shall terminate he will not be entitled to participate in the Knesset's sittings, or the meetings of a Knesset committee, save for the purpose of voting. (4) The Member of the Knesset is entitled to appeal to the Supreme Court on the decision of the Knesset to terminate his membership. (5) This clause shall not apply in a period of elections, as prescribed by law. (6) Details regarding the submission of the request, its deliberation and objections to the decision shall be laid down by law or in the Knesset Rules of Procedure. (a) In the case of a Member of the Knesset, who has been convicted of a felony, and the court has ruled, upon its own initiative or at the request of the Attorney General, that the offence involves moral turpitude, he shall be suspended from his membership in the Knesset from the day on which the court gave its ruling, and until the date on which the verdict became final. (b) A Member of the Knesset, who was convicted of a felony, and was sentenced to imprisonment, shall be suspended from his membership in the Knesset for the period of his imprisonment. Ending the Knesset membership of a minister or a deputy minister (Amendments Nos. 49, 51 & 52) (Amendment No. 52)"
    },
    {
      "provision_ref": "sec42c",
      "section": "42c",
      "title": "Nos. 49, 51 & 52)",
      "content": "(b1) The provisions of this article shall also apply to a Member of the Knesset, who has been convicted of an offence, as stated in clauses (a) or (b), before he became a Member of the Knesset. (a) A Member of the Knesset, who serves as a minister or a deputy minister is entitled to terminate his membership in the Knesset on the basis of the provisions of this article. Terminating the membership as stated shall be by means of a written notice to the Speaker of the Knesset, with the attachment of the written approval of the Chairperson of the Knesset Members’ Parliamentary Group, and the provisions of article 40 shall apply to it. The provisions of this article shall not apply to a Member of the Knesset serving as Prime Minister, his Deputy, the Alternate Prime Minister, or the Acting Prime Minister. (a1) Despite what is said in clause (a), a Member of the Knesset, who serves as a minister or as a deputy minister is not entitled to stop his membership in the Knesset in accordance with this article in the period from the beginning of the term of a new Knesset, and until the formation of a government in accordance with article 13 or 13a(e) to Basic-Law: The Government, and from the 90th day before the Knesset’s election day, in accordance with article 9, or from the day on which the reason was created for the holding of elections in accordance with article 34 or 36a, or in accordance with article 11(b) or 29(f) to Basic-Law: The Government, as applicable. (b) The Knesset membership of a Member of the Knesset, who submitted a notice as stated in clause (a), shall terminate 48 hours after the notice reached the hands of the Knesset Speaker, unless he retracted from his previous notice in a written notice to the Speaker of the Knesset. Should the said period end on a rest day, it shall be put off to the following day that is not a rest day, and all as prescribed by law. (c) (Amendments Nos. 51 & 52) (d) Should the Knesset membership of a minister or a deputy minister terminate on the basis of the provisions of this article, his membership in the Knesset to which he was elected shall be renewed, should one of the following occur: (1) He ceased to serve as a minister or a deputy minister; (2) He became Prime Minister, or Alternate Prime Minister; (3) He was assigned to serve as Acting Prime Minister; (4) He became Deputy Prime Minister. (1) These provisions shall apply with regards to the maximal number of Knesset Members in the same parliamentary group, who may terminate their membership in the Knesset according to this article: (a) Should the Parliamentary Group number one to three Members of the Knesset – half the members of the Parliamentary Group may terminate their membership. Should the result of the calculation not lead to a whole number, the number shall be completed to the next whole number; (a1) Should the Parliamentary Group number four to six Members of the Knesset – three Members of the Knesset may terminate their membership; (2) (e) (b) Should the Parliamentary Group number seven to nine Members of the Knesset – four Members of the Knesset may terminate their membership; (c) Should the Parliamentary Group number between ten to seventeen Members of the Knesset – five Members of the Knesset may terminate their membership. (d) Should the Parliamentary Group number at least eighteen members of the Knesset – a third of the members of the Parliamentary Group may terminate their membership. Should the result of the calculation not lead to a whole number, the number shall be completed to the next whole number. A change in the number of members of a parliamentary group resulting, inter alia, because of splitting or a merger with another parliamentary group, shall not affect the termination of the Knesset membership of a Member of the Knesset before the change, as stated. Should the Knesset membership of a Member of the Knesset terminate in accordance with this article, and his membership in the Knesset was renewed because he ceased to serve as a minister, or ceased to serve as a deputy minister, due to circumstances other than those listed in article 26(2) of Basic-Law: The Government, his membership in the Knesset shall not be terminated again in accordance of the provisions of this article, during the term of that Knesset. (f) (Amendment No. 52) (g) (1) Despite what is said in clause (c) a minister or a deputy minister who was a Member of the Knesset and terminated his membership in the Knesset on the basis of this article, and a Member of the Knesset, who is a minister or deputy minister, who are members of the same parliamentary group, are entitled to inform the Speaker of the Knesset in a joint written notice of the renewal of the Knesset membership of the minister or deputy minister whose membership was terminated, and the termination of the service of the other Knesset Member, at the same time (in this Basic Law - the replacement notice). (2) The provisions of clause (b), with the required changes, shall apply to the renewal of membership and termination of membership in the Knesset in accordance with the replacement notice. However, a retraction from the replacement notice shall take place only by means of a written joint notice by those submitting the replacement notice to the Speaker of the Knesset. (3) A Member of the Knesset, whose Knesset membership was renewed on the basis of paragraph (1) shall not submit an additional replacement notice during the term of that Knesset. A minister or a deputy minister, who ended his membership in the Knesset in accordance with this article, and submitted a letter of resignation in accordance with article 22(a) or 26(1) to Basic-Law: The Government, or who received a letter of removal from office in accordance with article 22(b), 26(3), 43d(b) or 43e(b) to Basic-Law: The Government, as applicable, is entitled to inform the Speaker of the Knesset, soon after the time of submission or receipt as stated, that his membership in the Knesset shall not be renewed, and he shall be considered to have resigned from the Knesset at the time of the end of his service in the Government. The provisions of article 40 shall apply to the notice to the Speaker of the Knesset, as stated in this clause, with the necessary changes. Replacement of Members of the Knesset (Amendments Nos. 7, 42 and temporary provision, & 49)"
    },
    {
      "provision_ref": "sec43",
      "section": "43",
      "title": "Nos. 7, 42 and temporary provision, & 49)",
      "content": "(a) Should the position of a Member of the Knesset fall vacant, he shall be replaced by a candidate - from the list of candidates that included his name – whose name appears first after the name of the last of the elected candidates. (b) The position of whoever has been suspended from membership in the Knesset on the basis of article 42b, shall be vacated for the period of the suspension, and he shall be replaced by the candidate as stated in clause (a). Should he resume his position, the last candidate in the list of candidates to have become a Member of the Knesset shall cease to serve, but his right to become a Member of the Knesset thereafter under clause (a) shall not be compromised. (c) The position of anyone whose Knesset membership was terminated on the basis of article 42c(a), shall be vacated, and he shall be replaced by the candidate as stated in clause (a). Should his membership be renewed on the basis of article 42c(c) the provisions of the final section of clause (b) shall apply. (d) The position of anyone whose Knesset membership was terminated on the basis of the replacement notice on the basis of article 42c(f) (in this article- the replaced Knesset Member), shall be vacated, and he shall be replaced by whoever submitted the replacement notice together with him, as stated in that article. (e) Once the membership of the replaced Knesset Member has been renewed on the basis of article 42c(c), the provisions of the final section of clause (b) shall apply. (f) Should the membership of the replaced Knesset Member be renewed in accordance with an additional replacement notice on the basis of article 42c(f), the provisions of clause (d) shall apply. Stability of the law"
    },
    {
      "provision_ref": "sec44",
      "section": "44",
      "title": "Stability of the law",
      "content": "Notwithstanding the provisions of any other law, Emergency Regulations cannot change, temporarily suspend, or subject this law to conditions. Rigidity of articles"
    },
    {
      "provision_ref": "sec45",
      "section": "45",
      "title": "Rigidity of articles",
      "content": "Article 44, or this article, may not be changed, save by a majority of eighty Members of the Knesset. Application of rigidity (Amendment No. 15)"
    },
    {
      "provision_ref": "sec45a",
      "section": "45a",
      "title": "Application of rigidity",
      "content": "The provision of article 45 shall apply also to a change of article 9a(a). When a special majority is required (Amendments Nos. 3, 11 & 15)"
    },
    {
      "provision_ref": "sec46",
      "section": "46",
      "title": "majority is required 11 & 15)",
      "content": "Under this law the majority required to change articles 4, 9a, 34, 44, or 45 shall be required for decisions in the Knesset plenum in first reading, second reading, and third reading. Regarding this article \"change\" – whether explicit or implicit."
    }
  ],
  "definitions": []
}