{
  "id": "basic-law-the-government-2001",
  "type": "statute",
  "title": "חוק יסוד: הממשלה",
  "title_en": "Basic Law: The Government, 5761-2001",
  "short_name": "BL-GOV",
  "status": "in_force",
  "issued_date": "2001-03-07",
  "in_force_date": "2001-03-07",
  "url": "https://m.knesset.gov.il/EN/activity/documents/BasicLawsPDF/BasicLawTheGovernment.pdf",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "The essence",
      "content": "The Government is the executive branch of the State. The seat"
    },
    {
      "provision_ref": "sec2",
      "section": "2",
      "title": "The seat",
      "content": "The seat of the Government is Jerusalem. Confidence of the Knesset in the Government"
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Confidence of the Knesset in the Government",
      "content": "The Government holds office by virtue of the confidence of the Knesset. Responsibility"
    },
    {
      "provision_ref": "sec4",
      "section": "4",
      "title": "Responsibility",
      "content": "The Government is collectively responsible to the Knesset. A minister is responsible to the Prime Minister for the tasks for which the Minister is responsible."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "The Government is collectively responsible to the Knesset. A minister is responsible to the Prime Minister for the tasks for which the Minister is responsible.",
      "content": "(a) The Government is made up of the Prime Minister and other ministers, and in a rotation government - also the Alternate Prime Minister. (b) The Prime Minister, and in a rotation government –the Alternate Prime Minister as well, shall be from among the Members of the Knesset. Another minister need not be from among the Members of the Knesset. (c) A minister shall be appointed to a ministry, but may be a minister without portfolio, or an additional minister in a ministry as detailed in article 24a. (d) One of the Ministers, who is a Member of the Knesset, may substitute for the Prime Minister. (e) A minister may be Deputy Prime Minister. (f) [Repealed] (a) A person who is not an Israeli citizen or a resident of Israel shall not be appointed as minister. (b) A person who serves in an office or position listed in article 7 of Basic-Law: The Knesset, shall not be appointed as minister, unless he has ceased to serve in Make-up of the Government (Amendments Nos. 1, 3 and 8 and temporary provision & No. 11) Eligibility of the Ministers"
    },
    {
      "provision_ref": "sec6",
      "section": "6",
      "title": "Eligibility of the Ministers",
      "content": "that office or that position upon, or prior to his appointment, as shall be prescribed by law. (c) Assigning the task of forming a government"
    },
    {
      "provision_ref": "sec7",
      "section": "7",
      "title": "Assigning the task of forming a government",
      "content": "(1) A person who has been convicted of an offence, and has been sentenced to actual imprisonment, and on the day of his appointment seven years have not gone by since he ended serving the punishment of an actual imprisonment, shall not be appointed as minister, unless the Chairperson of the Central Elections Committee has ruled that there is no moral turpitude involved in the circumstances of the offence for which he was convicted. (2) The Chairperson of the Central Elections Committee shall not rule as stated in clause (1), if the court has ruled that the offence for which he was sentenced involves moral turpitude. (d) A person shall not be appointed as minister if he has a citizenship that is other than Israeli, if the laws in the country of which he is a citizen enables his release from this citizenship, only after he has done whatever is necessary on his part to be released from it. (e) A Member of the Knesset who has withdrawn from his Parliamentary Group, and did not resign from his service soon after withdrawing, shall not be a minister during the term of that Knesset. This provision shall not apply to a parliamentary group that has split in accordance with the conditions prescribed by law. For the purpose of this clause, \"withdrawing from a parliamentary group\" - as defined in article 6a of (f) With regards to this article – “Actual imprisonment” – including conditional imprisonment that was put into action. “Offence” – each of the offences for which he/she was sentenced to actual imprisonment. (a) Once a new government must be formed, after consulting the representatives of the Parliamentary Groups, the President of the State shall assign the task of forming a government to one of the Knesset Members, who has agreed to do so. The President shall assign the said task within seven days from the publication of the election results, or from the day on which the need to form a new government was created, and in the case of the death of the Prime Minister within 14 days of his death. (b) Should these consultations take place before the new Knesset has convened, the President shall consult with the representatives of the lists of candidates, which shall be represented in the new Knesset. (c) This article shall not apply to the formation of a government following the expression of noconfidence, on the basis of article 28, or following the submission of a request to the President of the State on the basis of article 29(b), and the provisions detailed in the relevant articles shall apply. Period for formation of a government"
    },
    {
      "provision_ref": "sec8",
      "section": "8",
      "title": "Period for formation of a government",
      "content": "The Member of the Knesset to whom the President of the State has assigned the task of forming a government on the basis of article 7, has 28 days in which to perform his task. The President is entitled to prolong this period by additional periods, as long as all together they shall not exceed 14 days. Reassignment of the task"
    },
    {
      "provision_ref": "sec9",
      "section": "9",
      "title": "Reassignment of the task",
      "content": "(a) Should the period mentioned in article 8 have elapsed, and the Member of the Knesset has not informed the President of the State that he has formed a government, or has informed him beforehand that he is unable to form a government, or that he has presented a government, and the Knesset rejected the request to express confidence in it on the basis of article 13(d), the President shall assign the task of forming a government to another Member of the Knesset, who has informed the President that he is willing to assume the task, or shall inform the Speaker of the Knesset that he sees no possibility of arriving at the formation of a government, and all within three days from the day on which the period ended, or from the day on which the Member of the Knesset announced that he is unable to form a government, or from the day on which the request to express confidence in the Government was rejected, as the case may be. (b) Before assigning the task of forming a government on the basis of this article, or before informing the Speaker of the Knesset that he sees no possibility of reaching the formation of a Government, the President is entitled to once again consult the representatives of the Knesset Parliamentary Groups. (c) The Member of the Knesset to whom the task of forming a government was assigned on the basis of this article, has a period of 28 days to accomplish his task. (a) Should the President of the State inform the Knesset Speaker, on the basis of article 9(a), that he sees no possibility of arriving at the formation of a government, or that he assigned the task of forming a government to a Member of the Knesset on the basis of that article, and the Member of the Knesset did not inform the President within 28 days that he has formed a government, or he informed him beforehand that he Assigning the task on the basis of request of a majority of the Knesset Members"
    },
    {
      "provision_ref": "sec10",
      "section": "10",
      "title": "the basis of request of a majority of the Knesset Members",
      "content": "is unable to form a government, or he presented a government and the Knesset rejected the request to expressed confidence in it on the basis of article 13(d), a majority of the Knesset Members are entitled to ask the President of the State, in writing, to assign the task to a certain Knesset Member, who has agreed to it in writing, and all within 21 days from the announcement of the President, or from the day on which the period mentioned in article 9(c) has elapsed, or from the day of the announcement of the Knesset Member that he is unable to form a government, or from the day on which the request to express confidence in the Government was rejected, as the case may be. Early elections in the absence of a government"
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Early elections in the absence of a government",
      "content": "(b) If a request has been submitted as stated in clause (a), within two days the President shall assign the task of forming a government to the Member of the Knesset mentioned in the request. (c) The Member of the Knesset upon whom the task of forming a government on the basis of this article was vested, has 14 days to perform his task. (a) If a request as stipulated in article 10(a) was not submitted, or if the Member of the Knesset failed to form a government in the period assigned to him on the basis of article 10(c), or if he informed the President beforehand that he is unable to form a government, the President of the State shall inform the Knesset Speaker thereof. (b) Should the President announce, as stated in clause (a), or if the Member of the Knesset charged with the task of forming a government, on the basis of article 10(a), presented a government, and the Knesset rejected the request to express confidence in it on the basis of article 13(d), the Knesset shall be deemed to have decided to dissolve itself before the end of its term, and the elections to the Knesset shall take place on the last Tuesday before the end of the 90 days from the announcement of the President, or from the day on which the request to express confidence in the Government was rejected. Cessation of proceedings to form a government"
    },
    {
      "provision_ref": "sec12",
      "section": "12",
      "title": "Cessation of proceedings to form a government",
      "content": "Once a law has been adopted for the dissolution of the Knesset, the proceedings for the formation of a government shall cease. Formation of the Government (Amendment No. 11)"
    },
    {
      "provision_ref": "sec13",
      "section": "13",
      "title": "Formation of the Government",
      "content": "(a) Once the President of the State has assigned the task of forming a government to a Member of the Knesset, he shall inform the Speaker of the Knesset, and the Speaker of the Knesset shall notify the Knesset thereof. Formation of rotation government (Amendment No. 8 and temporary provision) 13a (b) Once the Member of the Knesset has formed a government, he shall inform the President of the State and the Speaker of the Knesset thereof, and the Speaker of the Knesset shall notify the Knesset thereof, and set a sitting for the purpose of forming the Government, within seven days from the day of the notification of the Knesset on the basis of this clause. (c) The Member of the Knesset who formed a government shall head it. (d) Once the Government has been formed, it shall present itself before the Knesset, announce the guidelines of its policy, its make-up, and the distribution of functions, or spheres of activity among the Ministers, and shall request an expression of confidence. The Government shall be formed once the Knesset has expressed confidence in it, and from that moment the Ministers shall assume office. (a) In this basic law – “Date of the rotation” – the stipulated date on which the rotation shall take place between the Prime Minister and the Alternate Prime Minister; “Rotation government” – a government that during its period of office the Member of the Knesset, who formed the Government, and an additional Member of the Knesset shall alternately stand at its head; “Alternate Prime Minister” – the Member of the Knesset designated to serve as Prime Minister in a rotation government, and the Member of the Knesset who served as Prime Minister in that Rotation Government before the rotation. (b) Despite what is said in article 13(c), the Government formed can be a rotation government on the basis of the provisions of this Basic Law. (c) In a rotation government, every minister and deputy minister shall be identified as being affiliated with the Prime Minister or with the Alternate Prime Minister. (d) (1) The number of ministers identified as having an affiliation with the Prime Minister shall be equal to the number of ministers identified as having an affiliation with the alternate Prime Minister. However, should the number of ministers be unequal, as stated, the Government shall lay down an apparatus for voting according to which the voting power of the total number of ministers having an affiliation with the Prime Minister in the Government shall be equal to the voting power of the total number of ministers having an affiliation with the Alternate Prime Minister, or rules with regards to the manner in which decisions are taken, that will promise the stated ratio. (Amendment No. 10) (2) (e) The provisions of paragraph (1) shall also apply to ministerial committees, save ministerial committees in which the identity of their members was prescribed by law, if the said law does not enable the Government to appoint additional members to them. Without detracting from the provisions of article 13(d) once a rotation government has been formed, it shall present itself before the Knesset, shall announce the following details, and shall request an expression of confidence: (1) The identity of the Prime Minister and the identity of the Alternate Prime Minister; (2) The date of the rotation; (3) The identity of the Ministers affiliated with the Prime Minister, and the identity of the Ministers affiliated with the Alternate Prime Minister. The Rotation Government shall be established once the Knesset has expressed confidence in it, and from that moment the Minister shall enter their offices. (f) Once the Knesset has expressed confidence in the Rotation Government, or as close as possible thereafter – (1) The Prime Minister shall make the following declaration of allegiance to the Knesset, with regards to his period of office as Prime Minister before the date of the rotation, and with regards to the period of his office as Alternate Prime Minister after the date of the rotation: \"I (the name) hereby undertake as Prime Minister and as the Alternate Prime Minister in future, to remain faithful to the State of Israel and its laws, and faithfully perform my office as Prime Minister, and as Alternate Prime Minister, and abide by the resolutions of the Knesset\". (2) The Alternate Prime Minister shall declare before the Knesset the following declaration of allegiance, with regards to his period of office as Alternate Prime Minister before the date of the rotation, and with regards to the period of his office as Prime Minister after the date of the rotation: \"I (the name) hereby undertake as Alternate Prime Minister and as Prime Minister in future, to remain faithful to the State of Israel and its laws, and faithfully perform my office as Prime Minister, and as Alternate Prime Minister, and abide by the resolutions of the Knesset\". (g) (h) Declaration of allegiance (in an ordinary government – translator’s comment)"
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "allegiance (in an ordinary government – translator’s comment)",
      "content": "Without detracting from the provisions of article 13(d), should the Knesset express confidence in the Rotation Government, when the date of the rotation arrives, the rotation shall be carried out in the following manner: (1) The service of the Prime Minister shall end, and the Alternate Prime Minister shall commence his service as Prime Minister; (2) On this date, and simultaneously, he whose office as Prime Minister came to an end, shall begin his service as Alternate Prime Minister. The carrying out of the rotation as stated in clause (g), does not require an additional expression of confidence by the Knesset, and an additional declaration of allegiance by the Prime Minister and the Alternate Prime Minister, and the rotation shall not be viewed as a resignation of the Government, as a resignation of the Prime Minister, and as a resignation of the Alternate Prime Minister, or as the formation of a new government. Once the Knesset has expressed confidence in the Government, or as soon as possible thereafter, the Prime Minister shall make the following declaration of allegiance to the Knesset: \"I (the name) hereby undertake as Prime Minister to remain faithful to the State of Israel and its laws, and faithfully perform my office as Prime Minister, and abide by the resolutions of the Knesset\", and each of the other Ministers shall make the following declaration of allegiance: \"I (the name) hereby undertake as Prime Minister to remain faithful to the State of Israel and its laws, and faithfully perform my office as Prime Minister, and abide by the resolutions of the Knesset\" And each of the other Ministers shall make the following declaration of allegiance: \"I (the name) undertake as a member of the Government to remain faithful to the State of Israel and its laws, to faithfully perform my position as a member of the Government, and abide by the resolutions of the Knesset\". Addition of a minister (Amendment No. 11)"
    },
    {
      "provision_ref": "sec15",
      "section": "15",
      "title": "abide by the resolutions of the Knesset\". Addition of a minister",
      "content": "The Government is entitled, on the basis of a proposal by the Prime Minister, to add an additional minister to the Government. Once the Government has decided to add a minister, it shall inform the Knesset thereof, and of the duties of the additional Minister, or the spheres of activity for which he is responsible. Upon the approval of the notification by the Knesset, the additional Minister shall take office, and as soon as possible after the approval shall make the declaration of allegiance. Substituting the Prime Minister (Amendment No. 12)"
    },
    {
      "provision_ref": "sec16",
      "section": "16",
      "title": "Substituting the Prime Minister (Amendment No. 12)",
      "content": "(a) Should the Prime Minister be absent from the country, his substitute shall convene the Government meetings and run them. (b) Should the Prime Minister be temporarily incapable of performing his duties, his position shall be performed by the Substitute Prime Minister. After the passage of 100 consecutive days on which the Substitute Prime Minister served in the place of the Prime Minister, and he did not return to perform his duties, he shall be considered to be incapable of performing his duties on a permanent basis. (b1) (1) The incapacity of the Prime Minister to perform his duties, as stated in clause (b), shall be due to physical or mental inability only, and shall be determined in one of the following situations only: (a) (1) Should the Prime Minster inform the Government and the Speaker of the Knesset that he is incapable of performing his duties temporarily due to physical or mental inability, and the House Committee confirmed his announcement by a majority of two thirds of its members. (2) Should the Prime Minister make a statement as mentioned in subclause (1), he is entitled to inform the Government and the Speaker of the Knesset of the continuation of the incapacity in the same notice, or in a separate notice. (3) The Speaker of the Knesset shall inform the Knesset of the Prime Minister’s notices in accordance with sub-paragraphs (1) and (2). (b) (1) Should the Government decide, by a majority of three quarters of its members, that the Prime Minister is temporarily incapable of performing his duties due to physical or mental inability; the Prime Minister shall convene the Government on this matter at the request of three fifths of the members of the Government within three days of the time that the request was made, or at a later date should it be requested in a request to do so. Should the government meeting fail to be convened at the time as stated, the Secretary of the Government shall convene the Government immediately, and the Substitute Prime Minister shall conduct the meeting, and clause (c) shall apply with the required changes. (2) Should the Government decide that the Prime Minister is temporarily incapable of performing his duties as stated in paragraph (1), the decision shall remain valid for three days and shall be brought for the approval of the House Committee. The House Committee shall approve the Government decision by a majority of two thirds of its members, and if the decision was taken due to health reasons, the decision of the House Committee shall be based also on a medical opinion, provided in accordance with rules determined by the House Committee. Should the House Committee approve the Government’s decision, it is entitled to decide that the incapacity shall not continue for over seven days from when the Committee’s decision was taken. (3) Should the Prime Minister fail to submit a medical opinion in accordance with the rules determined by the House Committee, he shall be considered to have announced his incapacity on the basis of sub-paragraph (a). The incapacity according to this paragraph shall not continue for more than seven days. (4) Interrogation of the Prime Minister during and after his tenure of office, submission of indictment, and conviction"
    },
    {
      "provision_ref": "sec17",
      "section": "17",
      "title": "office, submission of indictment, and conviction",
      "content": "The prolongation of the incapacity beyond what is said in paragraphs (2) or (3) requires a Knesset decision, on the basis of a proposal of the House Committee, adopted by a majority of eighty Members of the Knesset. The Knesset shall be entitled to determine that the incapacity shall not continue for more than 21 days each time, as long as the total number of the periods shall not be above what is said in clause (b). (2) The House Committee is entitled to determine the end of the Prime Minister’s incapacity, that was decided in accordance with paragraph (1)(b)(2) or (4) by a decision of a majority of the members of the Committee, and if incapacity was determined for health reasons – on the basis of a medical opinion provided on the basis of rules determined by the Committee. The Chairperson of the House Committee shall inform the Knesset of the Committee’s decision. (3) The provisions of article 31 of Basic-Law: The Knesset, or in accordance with it shall not apply to dates laid down in this clause. (c) Should there be no substitute for the Prime Minister, or if the Substitute Prime Minster is unable to perform his duties on the basis of clauses (a) and (b), the Government shall designate another minister, who is a Member of the Knesset, to perform these duties. (a) A criminal investigation shall not be opened against the Prime Minister save with the consent of the Attorney General. (b) A criminal investigation shall not be opened against whoever served as Prime Minister, due to a suspicion of the performance of an offence that was performed during his tenure of office, or during the year after he ceased to serve, save with the consent of the Attorney General. (c) An indictment against the Prime Minister shall be filed by the Attorney General to the District Court in Jerusalem, which shall be made-up of three judges. Provisions regarding an indictment that was filed before the Prime Minister took office, shall be prescribed by law. Termination of service of the Prime Minister due to an offense"
    },
    {
      "provision_ref": "sec18",
      "section": "18",
      "title": "Termination of service of the Prime Minister due to an offense",
      "content": "(d) The court that convicted the Prime Minister for an offence, shall determine in its verdict whether the offense involves moral turpitude. (a) The Knesset is entitled, by means of a resolution by the majority of its members, to remove from office the Prime Minister, who was convicted of an offence, and the court decided in its verdict that it involves moral turpitude. (b) Within 30 days of the day on which the verdict was delivered as stated in clause (a), the Knesset House Committee shall decide on its recommendation regarding the removal of the Prime Minister from office, and shall bring its recommendation to the Knesset Plenum. Should the House Committee fail to bring its recommendation within the prescribed period, the Speaker of the Knesset shall raise the issue for debate in the Knesset Plenum. (c) The House Committee and the Knesset shall decide on the removal of the Prime Minister from office only after he has been given the opportunity to state his case to them. (d) Should the Prime Minister not be removed from office under this article, and the verdict as stated in clause (a) has become final, the service of the Prime Minister shall be terminated, and the Government shall be deemed to have resigned on the day on which the verdict became final. (e) The provisions of articles 42a and 42b of Basic-Law: The Knesset shall not apply to the Prime Minister. Resignation of the Prime Minister"
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Resignation of the Prime Minister",
      "content": "The Prime Minister may resign by submitting a letter of resignation to the President of the State, after notifying the Government of his intention to do so. The resignation of the Prime Minister is equivalent to the resignation of the Government. The Prime Minister who has passed away or is unable to perform the duties permanently"
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "who has passed away or is unable to perform the duties permanently",
      "content": "(a) Should the Prime Minister pass away, the Government is considered to have resigned on the day of his passing. (b) Should the Prime Minister be unable to perform his duties on a permanent basis, the Government is considered to have resigned on the 101st day on which a replacement served in his place. (a) The Prime Minister, who has ceased to be a Member of the Knesset, shall be deemed to have resigned from The Prime Minister or his substitute, who"
    },
    {
      "provision_ref": "sec21",
      "section": "21",
      "title": "The Prime Minister or his substitute, who",
      "content": "have ceased to be Members of the Knesset Termination of service of a minister (Amendment No. 2) Termination of service of a Minister due to an offence Substituting a minister his office on the day that his membership in the Knesset ended. The resignation of the Prime Minister is equivalent to the resignation of the Government."
    },
    {
      "provision_ref": "sec24",
      "section": "24",
      "title": "23.",
      "content": "(b) A Minister, who is serving as a substitute for the Prime Minister, who has ceased to serve as Member of the Knesset, shall cease to serve as the substitute Prime Minister. (a) A minister, save the Prime Minister, is entitled to resign from the Government by submitting a letter of resignation to the Prime Minister, after giving notice to the Government of his intention to do so. His service in the Government shall end 48 hours after the letter of resignation was submitted to the Prime Minister, unless the Minister retracted his resignation beforehand. Should the said period end on a rest-day, its end shall be deferred to the next day that is not a rest day, all as prescribed by law. (b) The Prime Minister is entitled to remove a minister from office, after giving notice to the Government of his intention to do so. The service of the Minister shall terminate 48 hours after the letter of the removal from office has been submitted to him, unless the Prime Minister has retracted beforehand. Should the said period end on a rest-day, its end shall be deferred to the next day that is not a rest day, all as prescribed by law. (c) The service of a minister in the Government shall end upon his being elected or appointed to one of the positions whose holders are barred from being candidates for the Knesset. (a) An indictment against a minister, except for offences to be determined by law, shall be submitted to and dealt with in a district court. Provisions regarding an indictment that was submitted before the Minister started to serve in his office shall be prescribed by law. (b) The court that convicted a minister for an offence, shall state in its verdict whether that offence involves moral turpitude. Should the court rule as stated, the service of the Minister shall terminate on the day that the verdict was delivered. (c) This article shall not apply to the Prime Minister. (a) Should a minister, excluding the Prime Minister, be absent from the country, the Government may decide that another minister shall substitute for him. The substitute shall perform all, or part of the duties of the Minister, all as determined by the Government. (b) Should a minister temporarily cease to perform his duties, or be incapable of doing so, the Prime Minister or another minister designated by the Government, shall fill the position. (c) The period in which the position of the Minister, who ceased to serve as stated in clause (b), shall be filled, shall not exceed three months. An additional minister in a ministry (Amendment No. 11) 24a In a ministry which has an appointed minister, an additional minister, who shall be responsible, subject to the appointed Minister of the Ministry, for specific spheres within the Ministry’s spheres of activity, can be appointed Deputy ministers [Amendments Nos. 1, 4, 8 (and temporary provision) & 10)"
    },
    {
      "provision_ref": "sec25",
      "section": "25",
      "title": "[Amendments Nos. 1, 4, 8 (and temporary provision) & 10)",
      "content": "(a) A minister in charge of a ministry may, with the consent of the Prime Minister and the approval of the Government, appoint one deputy minister to that Ministry from among the Members of the Knesset. However, the Prime Minister is entitled to appoint, as stated, two deputy ministers in the Prime Minister’s Office. A deputy minister shall enter office once the Government has notified the Knesset of the appointment. A deputy minister appointed by the Prime Minister shall be called \"Deputy Minister in the Prime Minister's Office\". (a1) As close as possible to his appointment, a deputy minister shall make the following declaration of allegiance before the Knesset: \"I (the name) undertake to remain faithful to the State of Israel and its laws, to faithfully perform my position as a deputy minister, and abide by the resolutions of the Knesset\". Expiration of service of a deputy minister (Amendments 4 & 9)"
    },
    {
      "provision_ref": "sec26",
      "section": "26",
      "title": "Expiration of service of a deputy minister",
      "content": "(b) A deputy minister shall act in the Knesset and in the Ministry to which he was appointed, in the name of the Minister who appointed him, within the framework of the matters delegated to him. (c) A Member of the Knesset, who withdrew from his parliamentary group shall not be appointed as deputy minister during the term of that Knesset. This provision shall not apply to the splitting of a parliamentary group under conditions prescribed by law. For the purpose of this clause \"withdrawing from a Parliamentary Group\" - as defined by article 6a of (d) [Repealed] The office of a deputy minister shall terminate in each of the following situations: (1) The deputy minister resigned by submitting a letter of resignation to the Minister who appointed him. The service of the Deputy Minister ends 48 hours after the letter of resignation is handed over to the Minister, who appointed him, unless the Deputy Minister retracted beforehand. Should the said period fall on a rest day, the termination shall be deferred to the following day that is not a rest day, and all as prescribed by law; (2) Should the Minister who appointed him cease being a minister, or being in charge of the said Ministry; (3) The Prime Minister, the Government, or the Minister who appointed the Deputy Minister, decided to terminate his service. However, the Prime Minister shall not remove a deputy minister from his office before informing the Government, or the Minister who appointed the Deputy Minister, of his intention to do so. The service of the Deputy Minister shall terminate 48 hours after the letter of removal from office was handed over to him as stated, unless the Prime Minister, the Government, or the Minister who appointed him, as the case may be, retracted beforehand. Should the said period come to an end on a rest day, its termination shall be deferred to the following day that is not a rest day, and all as prescribed by law; (4) A new Government has been formed; (5) The Deputy Minister ceased being a Member of the Knesset. Terminating the service of a deputy minister due to an offence"
    },
    {
      "provision_ref": "sec27",
      "section": "27",
      "title": "service of a deputy minister due to an offence",
      "content": "The court that convicted a deputy minister of an offence, shall state in its verdict whether that offence involves moral turpitude. Should the court rule as stated, the service of the Deputy Minister shall end on the day that the verdict was delivered. Expression of noconfidence in the Government (Amendment No. 1)"
    },
    {
      "provision_ref": "sec28",
      "section": "28",
      "title": "Expression of noconfidence in the Government",
      "content": "(a) The Knesset is entitled to express no-confidence in the Government. (b) The expression of no-confidence in the Government shall be performed by means of a resolution of the Knesset, adopted by a majority of its Members, to express confidence in another Government that announced the basic guidelines of its policy, its makeup and the distribution of functions among the Ministers, as stated in article 13(d). The new Government shall be established once the Knesset has expressed confidence in it, and from that time the Ministers shall enter office. Authority to dissolve the Knesset (Amendment No. 1)"
    },
    {
      "provision_ref": "sec29",
      "section": "29",
      "title": "Authority to dissolve the Knesset",
      "content": "(c) Details regarding the submission of a motion to express no-confidence in the Government, and the debate on it shall be prescribed by law or the Knesset Rules of Procedure. Should the Motion be submitted by 61 Members of the Knesset, a debate shall take place as soon as possible, and no later than a week from the day of its submission. (a) Should the Prime Minister realize that there is a majority in the Knesset, which opposes the Government, and that as a result the effective activity of the Government is prevented, he is entitled, with the consent of the President of the State, to dissolve the Knesset by means of an order to be published in the Official Gazette. The order shall enter into force 21 days after its publication, unless a request has been submitted, on the basis of clause (b), and the Government is deemed to have resigned on the day that the order was published. (b) Within 21 days of the publication of the order, the majority of the Knesset Members are entitled to request the President of the State in writing to assign the formation of a government to a certain Member of the Knesset, who agreed to it in writing, and who is not the Prime Minister. (c) Should a request be submitted to the President of the State as aforesaid in clause (b), the President shall notify the Speaker of the Knesset thereof. Within two days the President shall assign the task of forming a Government to the Member of the Knesset named in the request. (d) The Member of the Knesset to whom the task of forming a government on the basis of this article was assigned by the President of the State, has 28 days to perform his task. The President is entitled to prolong this period by additional periods, as long as they shall not together exceed 14 days. (e) Should no request have been submitted as stated in clause (b), or should the period mentioned in clause (d) have elapsed, and the Member of the Knesset has not informed the President that he has formed a government, or should he have informed him beforehand that he is unable to form a government, the President of the State shall notify the Speaker of the Knesset thereof. (f) Should the President of the State give notice as stated in clause (e), or should the Member of the Knesset to whom the task of forming a Government on the basis of this article was assigned have presented a government, and the Knesset rejected the request to express confidence in it on the basis of article 13(d), the Knesset shall be deemed to have decided to dissolve itself before the end of its term, and elections to the Knesset shall be held on the last Tuesday before the end of the 90 days from the day on which the order came into force, or from the day on which the period for forming the Government ended, or from the day of the notification of the President, or from the day on which the request to express confidence in the Government was rejected, as the case may be. (g) Continuity of the Government (Amendment No. 1 & 9)"
    },
    {
      "provision_ref": "sec30",
      "section": "30",
      "title": "Government 9)",
      "content": "The Prime Minister shall not be entitled to use his authority on the basis of this article (1) from the beginning of the term of a new Knesset, until the formation of the new Government; (2) [Repealed] (3) after the resignation of the Prime Minister, or from the day on which a verdict was given in which it was determined that he was responsible for an offence that involves moral turpitude, until the day on which the Knesset adopted a resolution on the basis of article 18(a). (h) A minister who is substituting for the Prime Minister shall not be entitled to exercise the authority granted the Prime Minister on the basis of this article. (a) Upon the election of a new Knesset, or the resignation of the Government as stated in articles 18, 19, 20 or 21, or upon the submission of a request on the basis of article 29(b), the President of the State shall begin proceedings for the formation of a new Government, as stated in this Basic Law. (b) Upon the election of a new Knesset, or the resignation of the Government as stated in articles 18, 19, 20, 21 or 29, the outgoing Government shall continue to perform its functions until the new Government is formed. (c) The resigning Prime Minister shall continue to perform his duties until the new Government is formed. Should the Prime Minister pass away, should he be permanently unable to perform his duties, or should his term be terminated due to an offence, the Government shall designate another Minister, who is a Member of the Knesset, and a member of the Prime Minister's Parliamentary Group, to serve as acting Prime Minister until a new Government is formed. (d) A Government serving on the basis of clause (b), is entitled to appoint a Member of the Knesset to be a minister in place of the minister who has ceased to serve. The appointment of a Minister under this clause does not require the approval of the Knesset. In this clause, “Member of the Knesset” – including a minister or a deputy minister whose membership in the Knesset was terminated in accordance with article 42c of Basic-Law: The Knesset. Assigning the task of forming a government to a minister or deputy minister, whose membership in the Knesset has terminated (Amendment No. 9) 30a Despite what is said in articles 7 to 11, 13 and 29, a minister or a deputy minister, whose membership in the Knesset was terminated in accordance with article 42c of Basic-Law: The Knesset, may be assigned the task of forming a government, may be the subject of a request to assign to him the task of forming a government, or may be proposed as a candidate to be Prime Minister, in accordance of the provisions of the said articles, even though he is not a Member of the Knesset, but once he is Prime Minister his membership in the Knesset shall be renewed in accordance with the provisions of article 42c(c)(2) of Basic-Law: the Knesset. Substitute Prime Minister, Acting Prime Minister, or Alternate Prime Minister, who is a minister or deputy minister, whose membership in the Knesset has terminated (Amendment No. 9) 30b Despite what is said in articles 5(d), 16(c), 30(c) and 43(a), one may select, in accordance with the said articles, a minister whose membership in the Knesset was terminated on the basis of article 42c of Basic-Law: The Knesset, to substitute for the Prime Minister, or to serve as Acting Prime Minister, or a minister or deputy minister whose membership in the Knesset was terminated, as stated, as Alternate Prime Minister, even though he is not a Member of the Knesset, but once he is selected as stated his membership in the Knesset shall be renewed in accordance with the provisions of article 42c(c) of the said basic law. Functioning of the Government (Amendment No. 11)"
    },
    {
      "provision_ref": "sec31",
      "section": "31",
      "title": "Functioning of the Government",
      "content": "(a) The Government is entitled, with the approval of the Knesset, to change the distribution of functions among the Ministers, except for the function of the Prime Minister. (b) The Government is entitled, with the approval of the Knesset, to transfer a power bestowed by law upon one minister to another minister, or a duty assigned to him by law, either completely or partially, to another minister. (c) The Government is entitled, with the approval of the Knesset, to unite ministries, divide them, abolish them, or establish new ministries. (c1) The Government is entitled, with the approval of the Knesset, to decide that a minister shall serve as an additional minister in a ministry, and lay down specific spheres from among the Ministry’s spheres of activity, for which that minister will be responsible, subject to the Minister appointed to the Ministry, in accordance with the provisions of article 24a. (c2) The Government is entitled, in a ministry in which an additional minister serves, to transfer spheres of activity between him and the appointed Minister. (d) The Government is entitled, with the approval of the Knesset, to transfer spheres of activity from one ministry to another. (e) The Government is entitled to appoint permanent or temporary ministerial committees, or ministerial committees for particular matters. Once a committee has been appointed, the Government may operate by its means. (f) The Government shall lay down procedures for its sittings and work, its manner of deliberations, and the way its resolutions shall be adopted, whether regularly or on a certain matter. Residual powers of the Government"
    },
    {
      "provision_ref": "sec32",
      "section": "32",
      "title": "Residual powers of the Government",
      "content": "The Government is authorized to perform in the name of the State, subject to all laws, any act, which is not assigned by law to another authority. Delegation of powers (Amendment No. 5)"
    },
    {
      "provision_ref": "sec33",
      "section": "33",
      "title": "Delegation of powers",
      "content": "(a) A power conferred by law upon the Government may be delegated by the Government to one of the ministers. This article shall not apply to powers of the Government based on this Basic Law, save powers in accordance with article 32. (b) A power conferred upon a minister by law, or transferred to him in accordance with article 31(b), save the power to issue regulations, may be delegated by the Minister, in full or partially, or with reservations, to a civil servant. (c) A power delegated by the Government to a minister, save the power to issue regulations, may be delegated by the Minister, in full, or partially, or with reservations, to a civil servant if authorized by the Government to do so. (c1) Should the Prime Minister serve as a minister responsible for a ministry, he is also entitled to delegate his power, in accordance with the provisions of clauses (b) and (c), to a deputy minister in that ministry. (d) For the purpose of this article, a power conferred upon the Government or a minister, refers also to a duty assigned to them. (e) The provisions of this article shall apply if there is no other intention implied by the law, which confers the authority or assigns the duty. Assumption of powers"
    },
    {
      "provision_ref": "sec34",
      "section": "34",
      "title": "Assumption of powers",
      "content": "A Minister, who is in charge of implementing a law, is entitled to assume any power, with the exception of powers of a judicial nature, which is conferred by that law upon a civil servant, unless another intention is implied in the law. The Minister is entitled to act as stated with regards to a particular matter, or a specific period. Confidentiality"
    },
    {
      "provision_ref": "sec35",
      "section": "35",
      "title": "Confidentiality",
      "content": "(a) (b) The deliberations and decisions of the Government and of ministerial committees regarding the following matters are confidential, and their disclosure and publication is forbidden: (1) State security; (2) Foreign relations of the State; (3) Another type of matters, which the Government considered their confidentiality as essential to the State, and declared them as such in an order, for the purpose of this article; (4) A matter, which the Government decided to keep confidential, as long as disclosure and publication of such a matter is not forbidden, except to those who knew of the decision. The provisions of clause (a) shall not apply to matters that the Government, or the Prime Minister, or anyone whom the Government or Prime Minister authorized for this purpose, permitted to be published, or matters the publication of which is required by law. Salaries and pensions"
    },
    {
      "provision_ref": "sec36",
      "section": "36",
      "title": "Salaries and pensions",
      "content": "The salaries of the Ministers and the Deputy Ministers, and other payments that shall be paid to them during their tenure of office, or following it, or to their next in kin following their death, shall be prescribed by law, or in a resolution of the Knesset, or of one of its committees that the Knesset authorized for this purpose. Regulations"
    },
    {
      "provision_ref": "sec37",
      "section": "37",
      "title": "Regulations",
      "content": "(a) A minister, who is responsible for the implementation of a law, is authorized to issue regulations for its implementation. (b) A law may authorize the Prime Minister, or a minister, to issue regulations on a matter prescribed by the authorization. (a) Should the Knesset ascertain that there is a state of emergency in the country, it may, upon its own initiative, or on the basis of a Government proposal, declare a state of emergency. Declaration of a state of emergency"
    },
    {
      "provision_ref": "sec38",
      "section": "38",
      "title": "Declaration of a state of emergency",
      "content": "Issuing Emergency Regulations."
    },
    {
      "provision_ref": "sec39",
      "section": "39",
      "title": "Issuing Emergency Regulations.",
      "content": "(b) The period of the declaration's validity shall be as prescribed by it, but shall not exceed a year. The Knesset is entitled to repeat its declaration of a state of emergency as stated. (c) Should the Government ascertain that there is a state of emergency in the country, and that as a result of the urgency of the matter, a declaration of a state of emergency must be made before the Knesset can be convened, it is entitled to declare a state of emergency. The validity of the declaration shall expire after seven days from the day on which it was issued, unless it has been approved or revoked beforehand by the Knesset, in a resolution of a majority of its Members. Should the Knesset fail to convene, the Government is entitled to repeat its declaration on a state of emergency, as provided for in this clause. (d) Declarations by the Knesset or by the Government regarding a state of emergency, shall be published in the Official Gazette. Should it not be possible to publish the declaration on the state of emergency in the Official Gazette, the declaration shall be published in some other suitable manner, as long as it shall be published in the Official Gazette as soon as it is possible to do so. (e) The Knesset is entitled, at any time, to revoke a declaration on a state of emergency. Notice of the revocation shall be published in the Official Gazette. (a) In a state of emergency, the Government is entitled to issue Emergency Regulations in order to defend the State, public security, and the maintenance of supplies and vital services. Emergency Regulations shall be laid on the table of the Knesset Foreign Affairs and Defense Committee, as soon as possible after they have been issued. (b) Should the Prime Minister deem it impossible to convene the Government, and that there is an urgent and vital need to issue Emergency Regulations, he is entitled to issue them, or authorize a minister to issue them. (c) Emergency Regulations have the power to change any law, and temporarily suspend it, or set conditions to it, as well as to impose or increase taxes or other compulsory payments, and all as long as there is no other provision in the law. (d) Emergency Regulations do not have the force to prevent recourse to the courts, prescribe punishment in advance, or permit an infringement of human dignity. Declaration of war, or the initiation of a significant military action (Amendments Nos. 6 &7)"
    },
    {
      "provision_ref": "sec40",
      "section": "40",
      "title": "significant military action (Amendments Nos. 6 &7)",
      "content": "(e) Emergency Regulations shall not be prescribed. and arrangements, measures and powers shall not be implemented under them, unless the state of emergency warrants this. (f) The force of Emergency Regulations shall expire three months after being issued, unless their force has been extended by law, or they have been revoked by the Knesset by means of a law, or by means of a resolution adopted by a majority of the Knesset Members. (g) Emergency Regulations shall go into force upon their being published in the Official Gazette. Should publication in the Official Gazette not be possible, they shall be published by other suitable means, provided they are published in the Official Gazette as soon as it will be possible to do so. (h) Should the state of emergency cease to exist, the Emergency Regulations shall remain in force for their prescribed duration, but no longer than 60 days after the state of emergency came to an end. Emergency Regulations the force of which was prolonged by law, shall remain in force. (a) The State shall not start a war, and shall not initiate a significant military operation, which is liable to lead, at a level of probability close to certainty, to war, save by force of a Government decision. (a1) Despite what is said in clause (a) and article 33(a), the Government is entitled to decide to delegate its authority on the basis of clause (a), in general or in a particular case, to a ministerial committee prescribed by law. Should the Government decide to delegate its authority to the Ministerial Committee, the Ministerial Committee shall use its authority only if the Prime Minister has decided that implementing the authority by the Committee, instead of the Government, is required, in the specific circumstances, due to reasons of state security or its foreign relations, including reasons of confidentiality involved in them. (a2) [Repealed – amendment No. 7] (b) Nothing in this article can prevent other military actions required for the purpose of defense of the State and public security. (c) Notification of a Government decision to start a war, or to initiate a significant military operation on the basis of clause (a) shall be submitted to the Knesset Foreign Affairs and Defense Committee as soon as possible, and should the decision be taken by the Ministerial Committee as stated in clause (a1), a notice shall be given thereof, as soon as possible, to the Government and to the Subcommittee of the Foreign Affairs and Defense Committee of the Knesset. The Prime Minister shall notify the Knesset Plenum as well, as soon as possible. The notification on other military actions, as stated in clause (b), shall be submitted to the Knesset Foreign Affairs and Defense Committee as soon as possible. Non-applicability of Emergency Regulations"
    },
    {
      "provision_ref": "sec41",
      "section": "41",
      "title": "Non-applicability of Emergency Regulations",
      "content": "Notwithstanding the provisions of any law, Emergency Regulations do not have the power to change this Basic Law, temporarily suspend its validity, or subject it to conditions. The Government and the Knesset Committees (Amendment No. 4)"
    },
    {
      "provision_ref": "sec42",
      "section": "42",
      "title": "the Knesset Committees",
      "content": "(a) The Government shall submit to the Knesset and its Committees information at their request, and shall assist them in the performance of their duties. Special provisions shall be laid down by law for the classification of information, when this is required for the defense of the security of the State and its foreign relations, or for the protection of its international trade relations, or for the protection of a privilege or confidentiality sanctioned by law. (b) The Knesset is entitled, upon the demand of at least forty of its Members, to hold a debate with the participation of the Prime Minister on a topic decided upon. Such a demand may be submitted no more than once a month. (c) The Knesset, and each of its committees are entitled to require the appearance of a minister before them, within the framework of their performance of their duties. (d) Any of the Knesset Committees is entitled, within the framework of performing its duties, to require a civil servant, or anyone else prescribed by law, to appear before it, by means of the Minister concerned, or with his knowledge. (e) A minister may speak before the Knesset and its Committees. (f) Details regarding the implementation of this article may be prescribed by law, or in the Knesset Rules of Procedure. Changing the election date (Amendment No. 1)"
    },
    {
      "provision_ref": "sec43",
      "section": "43",
      "title": "Changing the election date (Amendment No. 1)",
      "content": "Should the date of elections to the Knesset be set on the basis of articles 11and 29, the Knesset is entitled, within five days after the grounds for the holding of the elections were created, to decide by means of a resolution adopted by a majority of its Members, that due to the proximity of the elections to a holiday, festival or day of commemoration, the elections should be deferred to a date that it shall decide upon, which is no later than 100 days from the date on which the grounds were created. Rotation between the Prime Minister and the Alternate Prime Minister not on the date of the rotation (Amendment No. 8 and temporary provision) 43a (a) Should the Prime Minister in a rotation government cease serving in his position at any time before the date of the rotation, this will be considered as if the Government resigned, and the continuity provisions in article 30(b) shall apply to the service of the Government and of the Prime Minister. However, in each of the following cases the Government shall not be seen as having resigned, and the rest of the provisions of this article shall apply: (1) The service of the Prime Minister ended in accordance with article 18(d); (2) The Prime Minister chose, of his own initiative, to resign from the Government, in accordance with article 19; (3) The Prime Minister passed away, as stated in article 2(a); (4) The Prime Minister is unable to perform his duties on a permanent basis, for health reasons only, and 100 days have lapsed, in which a substitute is serving in his place, in accordance with article 20(a); (5) The Prime Minister chose, of his own initiative to resign from the Knesset, in accordance of article 21(a). (b) Should the Prime Minister in a rotation government cease serving in his position for one of the reasons listed in the final section of clause (a), in the period until the date of the rotation, the provisions of clauses (c) and (d) shall apply. (c) The Alternate Prime Minister shall serve in his place as Prime Minister for the period of time that the Alternate Prime Minister should have served as Prime Minister, from the date of the rotation and until the end of the term of the Knesset. Should the term of office of the Alternate Prime Minister as Prime Minister end as stated, the provisions of clause (d) shall apply. (d) (1) Should the Prime Minister cease to serve in his position in accordance with clause (a)(4), and the state of his health shall enable his return to office – he shall return to serve in the position of the Prime Minister. (2) Should the Prime Minister cease to serve in his position in accordance with clause (a)(1), (2), (3) or (5), or should he cease to serve in his position in accordance with clause (a)4, and the state of his health does not enable his return to office – his Parliamentary Group is entitled to select a Member of the Knesset from the same Parliamentary Group, and he shall request the Knesset to express confidence in his serving in place of the Prime Minister, whose service ended as stated, and all until one week before the end of the service of the Alternate Prime Minister as Prime Minister. (3) Once the Knesset has expressed its confidence in the Member of the Knesset mentioned in paragraph (2), or as soon as possible thereafter, the Member of the Knesset shall declare before the Knesset a declaration of allegiance as stated in article 13a(f) or 14, as the case may be, and shall start serving as the Prime Minister upon the end of the term of office of whoever ceased serving as the Prime Minister. (4) Should the Parliamentary Group fail to select a Member of the Knesset from the same Parliamentary Group to replace the Prime Minister, who ceased to serve as stated in paragraph (2) until a week before the end of the period of service of the Prime Minister, or should the Parliamentary Group select a Member of the Knesset, as stated, but the Knesset failed to express confidence in him until that date – the Government shall be considered to have resigned, and the provisions of article 30 shall apply. (e) Should the Prime Minister in a rotation government cease to serve in his position for whatever reason, after the date of the rotation, the Alternate Prime Minister shall serve in his place and he shall request the Knesset to express confidence in his serving in place of the Prime Minister whose service ended as stated, and all until one week before the end of the service of the Alternate Prime Minister as Prime Minister. (f) (1) Should the Alternate Prime Minister in a rotation government cease to serve in his position until the date of the rotation, his Parliamentary Group is entitled to select a Member of the Knesset from the same Parliamentary Group, and he shall request the Knesset to express confidence in his serving in place of the Alternate Prime Minister, whose service ended as stated. Once the Knesset has expressed confidence in the said Member of the Knesset, or as soon as possible thereafter, that Member of the Knesset shall declare before the Knesset a declaration of allegiance, as stated in article 13a(f), and he shall be considered the Alternate Prime Minister, to all effects and purposes. (2) Rotation between the Prime Minister and the Alternate Prime Minister due to the dissolution of the Knesset before the end 43a1 of its term (Amendment No. 10) Should the Parliamentary Group of the Alternate Prime Minister select a Member of the Knesset from the same Parliamentary Group to serve instead of the Alternate Prime Minister as stated in paragraph (1), but the Knesset did not express confidence in him until a week before the end of the service of the Prime Minister, the Government shall be considered to have resigned, and the provisions of article 30 shall apply. Without detracting from the provisions of articles 13a and 43a, rotation between the Prime Minister and the Alternate Prime Minister shall take place before the date of the rotation in accordance to the provisions of article 13a(g) and (h), also in any one of the dates detailed below: (1) The day after the Knesset adopted in Third Reading a law for the dissolution of the Knesset before the end of its term in accordance with article 34 of Basic-Law: The Knesset, and as long as at least two Members of the Knesset who were members of parliamentary groups, whose Ministers were identified as having an affiliation with the Prime Minister on the date that the Rotation Government was formed, voted for it in Third Reading. In this case, a Member of the Knesset, who at the time of the swearing in of the Rotation Government did not express confidence in it, shall not be included in the counting of the said Members of the Knesset; (2) On the determining day according to its meaning in article 36a in Basic-Law: The Knesset, if the Budget Law was not adopted until the preceding day. The Alternate Prime Minister – the Substitute Prime Minister (Amendment No. 8, and temporary provision)"
    },
    {
      "provision_ref": "sec43b",
      "section": "43b",
      "title": "Minister (Amendment No. 8, and temporary provision)",
      "content": "The Alternate Prime Minister in a rotation government shall be the Substitute Prime Minister in accordance with article 5(d), and no other substitute to the Prime Minister shall be appointed. Removal from office of the Alternate Prime Minister (Amendment No. 8, and temporary provision)"
    },
    {
      "provision_ref": "sec43c",
      "section": "43c",
      "title": "Minister (Amendment No. 8, and temporary provision)",
      "content": "Despite what is said in article 22(b), the Prime Minister in a rotation government is not entitled to remove the Alternate Prime Minister from his office. Ministers in rotation governments (Amendment No. 8 and temporary provision & No. 11) Deputy ministers in a rotation government (Amendments No. 8 and temporary provision & 10)"
    },
    {
      "provision_ref": "sec43e",
      "section": "43e",
      "title": "43d.",
      "content": "(a) Despite what is said in article 22(b), the Prime Minister in a rotation government is not entitled to remove from office a minister affiliated to the Alternate Prime Minister. (b) The Alternate Prime Minister in a rotation government is entitled, after informing the Government of his intention to do so, to remove from office a minister affiliated to him, and the provisions of article 22(b) shall apply to this matter, with the necessary changes. (c) The substitute of a minister in a rotation government in accordance with article 24(a), shall be a minister with an identical affiliation to that of the Minister, whom he substitutes. (d) Despite what is said in article 24(b), should a minister in a rotation government cease to serve, or he is temporarily unable to perform his job, the Prime Minister, the Alternate Prime Minister, or another minister designated by the Government on the basis of a proposal by the Prime Minister or the Alternate Prime Minister, shall perform the job, and all in accordance with the affiliation of the said Minister. (e) The provisions of article 24(b) shall not apply to the Alternate Prime Minister, who has ceased serving, or who is temporarily unable to perform his job. (f) Despite what is said in article 15, a rotation government is entitled to add an additional minister to the Government, on the basis of a proposal by the Prime Minister, or the Alternate Prime Minister, and all subject to the provisions of article 13a(d). Should the Government decide to add a minister as stated, it shall notify the Knesset of his duties, or the spheres of activity for which the additional Minister shall be responsible, and his affiliation to the Prime Minister or to the Alternate Minister. Upon the approval of the notice the additional Minister shall enter his office, and as soon as possible to the approval shall make the declaration of allegiance. (g) [Expired] (a) Despite what is said in article 25(a), a minister in a rotation government, who is in charge of a ministry, is entitled to appoint to that ministry, from among the Members of the Knesset, one deputy minister, and in the Prime Minister’s Office – two deputy ministers, with the approval of the Prime Minister or the Alternate Prime Minister, in accordance to the affiliation of the appointed minister and with the approval of the Rotation Government. In the notice of the Government to the Knesset about the appointment of the Deputy Minister, the Government shall note the affiliation of the Deputy Minister to the Prime Minister or to the Alternate Prime Minister. (b) Despite what is said in article 26(3) – (1) The Prime Minister is entitled to terminate the service of a deputy minister with an affiliation to himself only, and the Alternate Prime Minister is entitled to terminate the service of a deputy minister with an affiliation to himself only; (2) A minister is not entitled to terminate the service of a deputy minister who he appointed, if the affiliation of the Deputy Minister is different from the affiliation of the Minister. The authority of the Prime Minister to dissolve the Knesset in a rotation government (Amendment 8 and temporary provision)"
    },
    {
      "provision_ref": "sec43f",
      "section": "43f",
      "title": "a rotation government temporary provision)",
      "content": "The authority of the Prime Minister in a rotation government to dissolve the Knesset by order in accordance with article 29(a) requires the consent of the Alternate Prime Minister. The status of the Alternate Prime Minister (Amendment 8 and temporary provision)"
    },
    {
      "provision_ref": "sec43g",
      "section": "43g",
      "title": "Minister (Amendment 8 and temporary provision)",
      "content": "(a) The legal status of the Alternate Prime Minister in a rotation government is the same of the legal status of the Prime Minister in accordance to articles 17, 18, 23(c) and 31(a). (b) Despite what is said in clause (a), should the Alternate Prime Minister in a rotation government cease to serve in his position in accordance to article 18(d) – the Government shall be considered to have resigned. Dissolution of the Knesset – temporary provision (Amendment No. 8 and temporary provision) 43g1. [Expired] No-confidence in a rotation government (Amendment No. 8 and temporary provision)"
    },
    {
      "provision_ref": "sec43h",
      "section": "43h",
      "title": "and temporary provision)",
      "content": "Should the Knesset decide to express no-confidence in a rotation government, and express confidence in another government, in accordance with article 28, neither the Prime Minister nor the Alternate Prime Minister shall be entitled to stand at the head of the other Government. Stability of the law"
    },
    {
      "provision_ref": "sec44",
      "section": "44",
      "title": "Stability of the law",
      "content": "(a) This Basic Law cannot be changed save by a majority of the Knesset Members. The majority required on the basis of this clause will be required for the decisions of the Knesset Plenum in first reading, second reading, and third reading. For the purpose of this article \"change\" - whether explicit or implicit. (b) The provisions of this article shall not apply to articles 45 and 46. Amendment of BasicLaw: The Knesset No. 30"
    },
    {
      "provision_ref": "sec45",
      "section": "45",
      "title": "Amendment of BasicLaw: The Knesset No. 30",
      "content": "[Was integrated into Basic-Law: the Knesset] Repeal of Basic-Law: The Government [5752-1992]"
    },
    {
      "provision_ref": "sec46",
      "section": "46",
      "title": "Repeal of Basic-Law: The Government [5752-1992]",
      "content": "Going into effect and application"
    },
    {
      "provision_ref": "sec47",
      "section": "47",
      "title": "Going into effect and application",
      "content": "(a) The provisions of this Basic Law shall apply to the elections, and the formation of the Government, as of the elections to the Sixteenth Knesset. (b) Subject to the provisions of clause (a), this Basic Law shall go into effect on the day that the Government shall be formed, as stated in clause (a). (c) Despite the provisions of clause (b), article 44 shall go into effect on the day that this Basic Law shall be published."
    }
  ],
  "definitions": []
}