{
  "id": "encouragement-of-research-law-1984",
  "type": "statute",
  "title": "חוק לעידוד מחקר ופיתוח וחדשנות טכנולוגית בתעשייה, תשמ\"ד-1984",
  "title_en": "Encouragement of Research, Development and Technological Innovation in Industry Law, 5744-1984",
  "short_name": "RDTL",
  "status": "in_force",
  "issued_date": "1984-12-10",
  "in_force_date": "1985-01-01",
  "url": "https://www.nevo.co.il/law_html/law01/999_101.htm",
  "description": "The Encouragement of Research, Development and Technological Innovation in Industry Law 5744-1984 (commonly known as the Innovation Authority Law, following 2016 amendments) establishes the Israel Innovation Authority (formerly Office of the Chief Scientist) and provides the framework for government support of R&D and technological innovation. It addresses IP protection, grant conditions, and restrictions on transfer of know-how abroad.",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Purpose",
      "content": "Section 1. The purpose of this Law is to encourage research, development, and technological innovation in Israeli industry for the purpose of developing the economy, improving the balance of payments, creating employment, and leveraging Israel's scientific and technological capabilities."
    },
    {
      "provision_ref": "sec3",
      "section": "3",
      "title": "Innovation Authority",
      "content": "Section 3. The Israel Innovation Authority shall operate programs for the encouragement and support of research and development in Israeli industry."
    },
    {
      "provision_ref": "sec14",
      "section": "14",
      "title": "Grant Conditions",
      "content": "Section 14. (a) The Innovation Authority may grant financial assistance for R&D programs that meet the criteria prescribed by the Research Committee. (b) Recipients of grants shall pay royalties to the Authority from the revenues generated by the supported R&D."
    },
    {
      "provision_ref": "sec19",
      "section": "19",
      "title": "Transfer of Know-How",
      "content": "Section 19. (a) Know-how developed with funding from the Authority shall not be transferred abroad or to a foreign entity without the approval of the Research Committee. (b) Approval may be conditioned on the payment of increased royalties or other conditions to ensure that the benefits of the R&D remain in Israel."
    },
    {
      "provision_ref": "sec20",
      "section": "20",
      "title": "IP Rights",
      "content": "Section 20. Intellectual property rights developed with the assistance of the Authority shall remain with the grant recipient, subject to the restrictions on transfer prescribed by this Law."
    }
  ],
  "definitions": []
}