{
  "id": "penal-law-1977",
  "type": "statute",
  "title": "חוק העונשין, תשל\"ז-1977",
  "title_en": "Penal Law, 5737-1977",
  "short_name": "PL",
  "status": "in_force",
  "issued_date": "1977-08-04",
  "in_force_date": "1977-08-04",
  "url": "https://www.nevo.co.il/law_html/law01/073_002.htm",
  "description": "The Penal Law 5737-1977 is the primary criminal code of Israel. It defines criminal offenses, penalties, defenses, and sentencing principles. Relevant sections address fraud, forgery, cybercrime (via amendments and the Computers Law), invasion of privacy, and economic crimes.",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Application",
      "content": "Section 1. This Law applies to offenses committed in Israel. It also applies to offenses committed abroad in certain circumstances prescribed by this Law."
    },
    {
      "provision_ref": "sec34",
      "section": "34",
      "title": "Mens Rea",
      "content": "Section 34. Criminal liability requires a criminal state of mind (mens rea) comprising intention, recklessness, or negligence, as defined in respect of each offense."
    },
    {
      "provision_ref": "sec244",
      "section": "244",
      "title": "Fraud",
      "content": "Section 244. A person who obtains a thing by fraud, deceit, or false pretenses is liable to imprisonment of 3 years. If the offense is committed in aggravating circumstances, the penalty is 5 years imprisonment."
    },
    {
      "provision_ref": "sec415",
      "section": "415",
      "title": "Theft",
      "content": "Section 415. A person who takes and carries away any property of another without the other's consent, with the intention of permanently depriving the other of the property, commits theft."
    },
    {
      "provision_ref": "sec418",
      "section": "418",
      "title": "Forgery",
      "content": "Section 418. A person who makes a false document with the intention that it be used as genuine commits forgery. The penalty for forgery is imprisonment of 1 to 7 years depending on the type of document."
    },
    {
      "provision_ref": "sec496",
      "section": "496",
      "title": "Invasion of Privacy (Criminal)",
      "content": "Section 496. A person who invades the privacy of another by any of the means specified in the Privacy Protection Law commits a criminal offense punishable by imprisonment of 5 years."
    }
  ],
  "definitions": []
}