{
  "id": "trade-secrets-law-1999",
  "type": "statute",
  "title": "חוק עוולות מסחריות, תשנ\"י-1999",
  "title_en": "Trade Secrets Law, 5759-1999",
  "short_name": "TSL",
  "status": "in_force",
  "issued_date": "1999-02-01",
  "in_force_date": "1999-02-01",
  "url": "https://www.nevo.co.il/law_html/law01/999_571.htm",
  "description": "The Trade Secrets Law 5759-1999 provides protection for confidential business information in Israel. It defines trade secrets, prohibits misappropriation, and establishes remedies including injunctions and damages. The law is relevant to cybersecurity as it protects proprietary technology, algorithms, and security configurations.",
  "provisions": [
    {
      "provision_ref": "sec1",
      "section": "1",
      "title": "Definitions",
      "content": "Section 1. In this Law: \"trade secret\" - business information that is not publicly known, that derives actual or potential commercial value from not being known, and the owner of which takes reasonable steps to maintain its secrecy; \"misappropriation\" - acquisition of a trade secret by improper means, or disclosure or use of a trade secret by a person who obtained it by improper means or in breach of a duty of confidence."
    },
    {
      "provision_ref": "sec5",
      "section": "5",
      "title": "Prohibition of Misappropriation",
      "content": "Section 5. No person shall misappropriate a trade secret. Misappropriation includes: (a) acquiring a trade secret by theft, bribery, fraud, breach of confidence, or other improper means; (b) disclosing or using a trade secret obtained by improper means; (c) disclosing or using a trade secret in breach of a duty of confidence."
    },
    {
      "provision_ref": "sec11",
      "section": "11",
      "title": "Remedies",
      "content": "Section 11. The court may grant any of the following remedies for misappropriation: (a) an injunction against further use or disclosure; (b) damages, including reasonable royalties; (c) delivery up or destruction of materials embodying the trade secret; (d) an account of profits derived from the misappropriation."
    }
  ],
  "definitions": [
    {
      "term": "trade secret",
      "definition": "Business information that is not publicly known, derives commercial value from not being known, and the owner takes reasonable steps to maintain its secrecy",
      "source_provision": "sec1"
    },
    {
      "term": "misappropriation",
      "definition": "Acquisition of a trade secret by improper means, or disclosure or use of a trade secret in breach of duty",
      "source_provision": "sec1"
    }
  ]
}